{"Cura Profile": "รายละเอียดการดูแล", "JPG Image": "ภาพ JPG", "JPEG Image": "ภาพ JPEG", "PNG Image": "PNG ภาพ", "BMP Image": "BMP ภาพ", "GIF Image": "ภาพ GIF", "Machine Settings": "การตั้งค่าเครื่อง", "Save to Removable Drive": "บันทึกไปยังไดรฟ์แบบถอดได้", "Save to Removable Drive {0}": "บันทึกเพื่อถอดออกไดรฟ์ {0}", "There are no file formats available to write with!": "ไม่มีรูปแบบไฟล์ที่มีอยู่ในการเขียนที่มีอยู่!", "Saving to Removable Drive<filename>{0}</filename>": "บันทึกไปยังไดรฟ์แบบถอดได้ <ชื่อไฟล์> {0} </ filename>", "Saving": "ประหยัด", "Could not save to <filename>{0}</filename>: <message>{1}</message>": "ไม่สามารถบันทึกไปยัง <ชื่อไฟล์> {0} </ filename> <ข้อความ> {1} </ ข้อความ>", "Could not find a file name when trying to write to {device}.": "ไม่พบชื่อแฟ้มเมื่อพยายามที่จะเขียนไปยังอุปกรณ์ {}", "Could not save to removable drive {0}: {1}": "ไม่สามารถบันทึกไดรฟ์แบบถอดได้{0}: {1}", "Error": "ความผิดพลาด", "Saved to Removable Drive {0} as {1}": "บันทึกไว้ในที่ถอดออกไดรฟ์ {0} เป็น {1}", "File Saved": "ไฟล์ที่บันทึกไว้", "Eject": "Eject", "Eject removable device {0}": "อุปกรณ์ที่ถอดออกได้ Eject {0}", "Warning": "คำเตือน", "Ejected {0}. You can now safely remove the drive.": "พุ่งออกมา {0} ขณะนี้คุณสามารถลบออกอย่างปลอดภัยไดรฟ์", "Safely Remove Hardware": "Safely Remove Hardware", "Failed to eject {0}. Another program may be using the drive.": "ล้มเหลวที่จะดีดออก {0} โปรแกรมอื่นอาจจะใช้ไดรฟ์", "Removable Drive": "ไดรฟ์แบบถอดได้", "\nDo you want to sync material and software packages with your account?": "คุณต้องการที่จะซิงค์แพคเกจวัสดุและซอฟต์แวร์ด้วยบัญชีของคุณหรือไม่", "Changes detected from your Ultimaker account": "พบการเปลี่ยนแปลงจากบัญชี Ultimaker ของคุณ", "Sync": "ซิงค์", "Decline": "ลดลง", "Agree": "ตกลง", "Plugin License Agreement": "ข้อตกลงการอนุญาตปลั๊กอิน", "Decline and remove from account": "ลดลงและลบออกจากบัญชี", "{} plugins failed to download": "{} ปลั๊กอินล้มเหลวในการดาวน์โหลด", "\nSyncing...": "ซิงค์ ...", "You need to quit and restart {} before changes have effect.": "คุณจำเป็นต้องปิดและเริ่มต้น {} ก่อนการเปลี่ยนแปลงมีผล", "AMF File": "AMF ไฟล์", "Solid view": "มุมมองที่เป็นของแข็ง", "Level build plate": "สร้างแผ่นระดับ", "Select upgrades": "เลือกการอัพเกรด", "USB printing": "พิมพ์ USB", "Print via USB": "พิมพ์ผ่านทาง USB", "Connected via USB": "เชื่อมต่อผ่าน USB", "A USB print is in progress, closing Cura will stop this print. Are you sure?": "พิมพ์ USB มีความคืบหน้าในการปิด Cura จะหยุดการพิมพ์นี้ คุณแน่ใจไหม?", "A print is still in progress. Cura cannot start another print via USB until the previous print has completed.": "พิมพ์ยังคงอยู่ในความคืบหน้า Cura ไม่สามารถเริ่มต้นการพิมพ์อื่นผ่านทาง USB จนกว่าพิมพ์ก่อนหน้านี้ได้เสร็จสิ้น", "Print in Progress": "พิมพ์ในความคืบหน้า", "tomorrow": "วันพรุ่งนี้", "today": "ในวันนี้", "Print over network": "พิมพ์ผ่านเครือข่าย", "Connected over the network": "เชื่อมต่อผ่านเครือข่าย", "Cura has detected material profiles that were not yet installed on the host printer of group {0}.": "Cura ได้ตรวจพบโปรไฟล์วัสดุที่ยังไม่ได้ติดตั้งบนเครื่องพิมพ์โฮสต์ของกลุ่ม {0}", "Sending materials to printer": "วัสดุเพื่อการส่งเครืองพิมพ์", "Sending Print Job": "ส่งงานพิมพ์", "Uploading print job to printer.": "งานพิมพ์อัปโหลดไปยังเครื่องพิมพ์", "Could not upload the data tothe printer.": "ไม่สามารถอัปโหลดข้อมูลไปยังเครื่องพิมพ์", "Network error": "ข้อผิดพลาดของเครือข่าย", "Print job was successfully sent to the printer.": "งานพิมพ์ถูกส่งเรียบร้อยแล้วไปยังเครื่องพิมพ์", "Data Sent": "ส่งข้อมูล", "Send and monitor print jobs from anywhere using your Ultimaker account.": "และส่งงานพิมพ์จอภาพจากที่ใดก็ได้โดยใช้บัญชีของคุณ Ultimaker", "Connect to Ultimaker Cloud": "เชื่อมต่อกับ Ultimaker เมฆ", "Get started": "เริ่ม", "Please wait until the current job has been sent.": "โปรดรอจนกว่างานปัจจุบันได้รับการส่ง", "Print error": "ข้อผิดพลาดในการพิมพ์", "You are attempting to connect to a printer that is not running Ultimaker Connect. Please update the printer to the latest firmware.": "คุณพยายามที่จะเชื่อมต่อกับเครื่องพิมพ์ที่ไม่ได้ทำงาน Ultimaker เชื่อมต่อ โปรดอัปเดตเครื่องพิมพ์กับเฟิร์มแวล่าสุด", "Update your printer": "อัพเดทเครื่องพิมพ์ของคุณ", "You are attempting to connect to {0} but it is not the host of a group. You can visit the web page to configure it as a group host.": "คุณกำลังพยายามที่จะเชื่อมต่อไปที่ {0} แต่มันไม่ได้เป็นเจ้าภาพของกลุ่ม คุณสามารถเยี่ยมชมหน้าเว็บเพื่อกำหนดค่าเป็นเจ้าภาพกลุ่ม", "Not a group host": "ไม่ได้เป็นเจ้าภาพกลุ่ม", "Configure group": "กลุ่มการกำหนดค่า", "Connect via Network": "เชื่อมต่อผ่านเครือข่าย", "Print via Cloud": "พิมพ์ผ่านระบบคลาวด์", "Connected via Cloud": "เชื่อมต่อผ่านระบบคลาวด์", "3MF File": "3MF ไฟล์", "Nozzle": "จมูกวัว", "Project file <filename>{0}</filename> contains an unknown machine type <message>{1}</message>. Cannot import the machine. Models will be imported instead.": "แฟ้มโครงการ <ชื่อไฟล์> {0} </ filename> มีประเภทเครื่องที่ไม่รู้จัก <ข้อความ> {1} </ ข้อความ> ไม่สามารถนำเข้าเครื่อง รุ่นจะถูกนำเข้าแทน", "Open Project File": "ไฟล์เปิดโครงการ", "Recommended": "แนะนำ", "Custom": "กำหนดเอง", "Support Blocker": "สนับสนุน Blocker", "Create a volume in which supports are not printed.": "สร้างไดรฟ์ที่สนับสนุนไม่ได้พิมพ์", "Per ModelSettings": "การตั้งค่าต่อรุ่น", "Configure Per Model Settings": "การกำหนดค่าการตั้งค่ารูปแบบการต่อ", "Preview": "ดูตัวอย่าง", "X-Ray view": "มุมมอง X-Ray", "G-code File": "G-รหัสไฟล์", "G File": "D เนื้อ", "Parsing G-code": "แยก G-รหัส", "G-code Details": "รายละเอียด G-รหัส", "Make sure the g-code is suitable for your printer and printer configuration before sending the file to it. The g-code representation may not be accurate.": "ตรวจสอบให้แน่ใจกรัมรหัสที่เหมาะสมสำหรับการตั้งค่าเครื่องพิมพ์และเครื่องพิมพ์ของคุณก่อนที่จะส่งไฟล์ไป การเป็นตัวแทนกรัมรหัสอาจไม่ถูกต้อง", "Post Processing": "โพสต์การประมวลผล", "Modify G-Code": "ปรับเปลี่ยน G-Code", "Unable to slice with the current material as it is incompatible with the selected machine orconfiguration.": "ไม่สามารถที่จะเชือดด้วยวัสดุในปัจจุบันในขณะที่มันไม่เข้ากันกับเครื่องที่เลือกหรือการกำหนดค่า", "Unable to slice": "ไม่สามารถชิ้น", "Unable to slice with the current settings. The following settings have errors: {0}": "ไม่สามารถหั่นกับการตั้งค่าปัจจุบัน การตั้งค่าดังต่อไปนี้มีข้อผิดพลาด: {0}", "Unable to slice due to some per-model settings. The following settings have errors on one or more models: {error_labels}": "ไม่สามารถฝานเนื่องจากบางต่อการตั้งค่ารูปแบบ การตั้งค่าต่อไปนี้มีข้อผิดพลาดในหนึ่งหรือมากกว่ารุ่น: {} error_labels", "Unable to slice because the prime tower or prime position(s) are invalid.": "ไม่สามารถชิ้นเพราะหอคอยที่สำคัญหรือตำแหน่งนายกรัฐมนตรี (s) ไม่ถูกต้อง", "Unable to slice because there are objects associated with disabled Extruder %s.": "ไม่สามารถชิ้นเพราะมีวัตถุที่เกี่ยวข้องกับคนพิการ Extruder% s", "Nothing to slice because none of the models fit the build volume or are assigned to a disabled extruder. Please scale or rotate models to fit, or enable an extruder.": "ไม่มีอะไรที่จะชิ้นเพราะไม่มีรูปแบบให้พอดีกับปริมาณการสร้างหรือกำหนดให้กับเครื่องอัดรีดพิการ โปรดขนาดหรือรูปแบบหมุนเพื่อให้พอดีหรือเปิดใช้งานเครื่องอัดรีด", "Processing Layers": "เลเยอร์การประมวลผล", "Information": "ข้อมูล", "Cura 15.04 profiles": "Cura 15.04 โปรไฟล์", "Ultimaker Format Package": "Ultimaker รูปแบบแพคเกจ", "Update Firmware": "อัปเดตเฟิร์มแว", "Prepare": "เตรียมการ", "Open Compressed Triangle Mesh": "เปิดการบีบอัดสามเหลี่ยมตาข่าย", "COLLADA Digital Asset Exchange": "COLLADA แลกเปลี่ยนสินทรัพย์ดิจิตอล", "glTF Binary": "glTF ไบนารี", "glTF Embedded JSON": "glTF แบบฝัง JSON", "Stanford Triangle Format": "รูปแบบสแตนฟอสามเหลี่ยม", "Compressed COLLADA Digital Asset Exchange": "การบีบอัด COLLADA แลกเปลี่ยนสินทรัพย์ดิจิตอล", "3MF file": "ไฟล์ 3MF", "Cura Project 3MF file": "ไฟล์ Cura โครงการ 3MF", "Error writing 3mf file.": "ข้อผิดพลาดในการเขียนไฟล์ 3mf", "GCodeWriter does not support non-text mode.": "GCodeWriter ไม่สนับสนุนโหมดที่ไม่ใช่ข้อความ", "Please prepare G-code before exporting.": "โปรดเตรียม G-รหัสก่อนที่จะส่งออก", "Monitor": "หน้าจอ", "Manage backups": "จัดการการสำรองข้อมูล", "Backup": "การสำรองข้อมูล", "There was an error listing your backups.": "เกิดข้อผิดพลาดในรายการสำรองข้อมูลของคุณเป็น", "There was an error trying to restore your backup.": "มีข้อผิดพลาดพยายามที่จะเรียกคืนการสำรองข้อมูลของคุณ", "Backups": "การสำรองข้อมูล", "Uploading your backup...": "อัปโหลดสำรองข้อมูลของคุณ ...", "There was an error while uploading your backup.": "เกิดข้อผิดพลาดขณะอัปโหลดสำรองของคุณ", "Your backup has finished uploading.": "การสำรองข้อมูลของคุณมีการอัปโหลดเสร็จแล้ว", "X3D File": "X3D ไฟล์", "Cura does not accurately display layers when Wire Printing is enabled.": "Cura ไม่ถูกต้องแสดงชั้นเมื่อพิมพ์สายไฟถูกเปิดใช้งาน", "Simulation View": "จำลองดู", "Saving to Removable Drive <filename>{0}</filename>": "บันทึกไปยังไดรฟ์แบบถอดได้ <ชื่อไฟล์> {0} </ filename>", "Could not upload the data to the printer.": "ไม่สามารถอัปโหลดข้อมูลไปยังเครื่องพิมพ์", "Per Model Settings": "การตั้งค่าต่อรุ่น", "Unable to slice with the current material as it is incompatible with the selected machine or configuration.": "ไม่สามารถที่จะเชือดด้วยวัสดุในปัจจุบันในขณะที่มันไม่เข้ากันกับเครื่องที่เลือกหรือการกำหนดค่า", "Nothing is shown because you need to slice first.": "ไม่มีอะไรที่จะแสดงเพราะคุณจะต้องชิ้นแรก", "No layers to show": "ไม่มีเลเยอร์ที่จะแสดง", "Layer view": "มุมมองชั้น", "Compressed G-code File": "การบีบอัด G-รหัสไฟล์", "3D Model Assistant": "โมเดล 3 มิติช่วย", "<p>One or more 3D models may not print optimally due to the model size and material configuration:</p>\n<p>{model_names}</p>\n<p>Find out how to ensure the best possible print quality and reliability.</p>\n<p><a href=\"https://ultimaker.com/3D-model-assistant\">View print quality guide</a></p>": "<p> หนึ่งหรือมากกว่า 3D รุ่นอาจไม่สามารถพิมพ์ได้อย่างดีที่สุดเนื่องจากขนาดรูปแบบและการกำหนดค่าวัสดุ: </ p>\n<p> {} model_names </ p>\n<p> หาวิธีการเพื่อให้แน่ใจว่าคุณภาพการพิมพ์ที่ดีที่สุดที่เป็นไปได้และความน่าเชื่อถือ. </ p>\n<p> <a href=\"https://ultimaker.com/3D-model-assistant\"> ดูคู่มือคุณภาพการพิมพ์ </a> </ p>", "GCodeGzWriter does not support text mode.": "GCodeGzWriter ไม่สนับสนุนโหมดข้อความ", "Could not access update information.": "ไม่สามารถเข้าถึงข้อมูลการปรับปรุง", "New features are available for your {machine_name}! It is recommended to update the firmware on your printer.": "คุณลักษณะใหม่ที่ใช้ได้สำหรับคุณ {} machine_name! ก็จะแนะนำให้อัปเดตเฟิร์มกับเครื่องพิมพ์ของคุณ", "New %s firmware available": "เฟิร์มแว% ใหม่ใช้ได้", "How to update": "วิธีการปรับปรุง", "Login failed": "เข้าสู่ระบบล้มเหลว", "The build volume height has been reduced due to the value of the \"Print Sequence\" setting to prevent the gantry from colliding with printed models.": "ความสูงสร้างปริมาณการได้รับการลดลงเนื่องจากค่าของการตั้งค่า \"พิมพ์ลำดับ\" เพื่อป้องกันไม่ให้กล้องจากชนกับรุ่นพิมพ์", "Build Volume": "ปริมาณรูปร่าง", "Loading machines...": "เครื่องกำลังโหลด ...", "Setting up preferences...": "การตั้งค่าการตั้งค่า ...", "Initializing Active Machine...": "เริ่มต้นใช้งานเครื่อง ...", "Initializing machine manager...": "เริ่มต้นผู้จัดการเครื่อง ...", "Initializing build volume...": "เริ่มต้นปริมาณการสร้าง ...", "Setting up scene...": "การตั้งค่าที่เกิดเหตุ ...", "Loading interface...": "กำลังโหลดอินเตอร์เฟซ ...", "Initializing engine...": "เริ่มต้นเครื่องยนต์ ...", "%(width).1f x %(depth).1f x %(height).1f mm": "% (กว้าง) x .1f% (ลึก) .1f x% (สูง) มม .1f", "Only one G-code file can be loaded at a time. Skipped importing {0}": "เพียงหนึ่งไฟล์ G-รหัสสามารถโหลดได้ตลอดเวลา การนำเข้าข้าม {0}", "Can't open any other file if G-code is loading. Skipped importing {0}": "ไม่สามารถเปิดไฟล์อื่น ๆ ถ้า G-รหัสโหลด การนำเข้าข้าม {0}", "The selected model was too small to load.": "รูปแบบที่เลือกมีขนาดเล็กเกินไปในการโหลด", "Could not create archive from user data directory: {}": "ไม่สามารถสร้างเก็บจากไดเรกทอรีข้อมูลผู้ใช้: {}", "Tried to restore a Cura backup without having proper data or meta data.": "พยายามที่จะเรียกคืนการสำรองข้อมูล Cura โดยไม่ต้องมีข้อมูลที่ถูกต้องหรือข้อมูลเมตา", "Tried to restore a Cura backup that is higher than the current version.": "พยายามที่จะเรียกคืนการสำรองข้อมูล Cura ที่สูงกว่ารุ่นปัจจุบัน", "Group #{group_nr}": "กลุ่ม # {} group_nr", "Add": "เพิ่ม", "Cancel": "ยกเลิก", "Close": "ปิด", "Outer Wall": "ผนังด้านนอก", "Inner Walls": "ผนังด้านใน", "Skin": "ผิว", "Infill": "infill", "Support Infill": "สนับสนุน Infill", "Support Interface": "อินเตอร์เฟซการสนับสนุน", "Support": "สนับสนุน", "Skirt": "กระโปรง", "Prime Tower": "นายกรัฐมนตรีทาวเวอร์", "Travel": "การท่องเที่ยว", "Retractions": "การถอน", "Other": "อื่น ๆ", "Next": "ต่อไป", "Multiplying and placing objects": "การขยายตัวและการวางวัตถุ", "Placing Objects": "วางวัตถุ", "Unable to find a location within the build volume for all objects": "ไม่สามารถที่จะหาสถานที่ในการสร้างปริมาณสำหรับวัตถุทั้งหมด", "Placing Object": "วางวัตถุ", "Default": "ค่าเริ่มต้น", "Visual": "ภาพ", "The visual profile is designed to print visual prototypes and models with the intent of high visual and surface quality.": "รายละเอียดภาพถูกออกแบบมาเพื่อการพิมพ์ภาพและต้นแบบรุ่นที่มีความตั้งใจที่คุณภาพของภาพและพื้นผิวสูง", "Engineering": "วิศวกรรม", "The engineering profile is designed to print functional prototypes and end-use parts with the intent of better accuracy and for closer tolerances.": "รายละเอียดทางวิศวกรรมถูกออกแบบมาเพื่อการพิมพ์ต้นแบบการทำงานและชิ้นส่วนสิ้นการใช้งานด้วยความตั้งใจที่ถูกต้องดีกว่าและความคลาดเคลื่อนใกล้ชิด", "Draft": "ร่าง", "The draft profile is designed to print initial prototypes and concept validation with the intent of significant print time reduction.": "รายละเอียดร่างถูกออกแบบมาเพื่อการพิมพ์ต้นแบบเริ่มต้นและการตรวจสอบแนวความคิดที่มีความตั้งใจที่จะลดเวลาการพิมพ์อย่างมีนัยสำคัญ", "Unknown": "ไม่ทราบ", "The printer(s) below cannot be connected because they are part of a group": "เครื่องพิมพ์ (s) ด้านล่างไม่สามารถเชื่อมต่อเพราะพวกเขาเป็นส่วนหนึ่งของกลุ่ม", "Available networked printers": "เครื่องพิมพ์เครือข่ายที่มีอยู่", "Not overridden": "ไม่ได้แทนที่", "Custom Material": "วัสดุที่กำหนดเอง", "Custom profiles": "โปรไฟล์ที่กำหนดเอง", "All Supported Types ({0})": "ประเภทการสนับสนุนทั้งหมด ({0})", "All Files (*)": "เอกสารทั้งหมด (*)", "Cura can't start": "Cura ไม่สามารถเริ่มต้น", "<p><b>Oops, Ultimaker Cura has encountered something that doesn't seem right.</p></b>\n                    <p>We encountered an unrecoverable error during start up. It was possibly caused by some incorrect configuration files. We suggest to backup and reset your configuration.</p>\n                    <p>Backups can be found in the configuration folder.</p>\n                    <p>Please send us this Crash Report to fix the problem.</p>\n                ": "<p> <b> โอ๊ะ Ultimaker Cura พบสิ่งที่ดูเหมือนจะไม่ถูกต้อง. </ p> </ b>\n                    <p> เราพบข้อผิดพลาดที่ไม่สามารถกู้ในช่วงเริ่มต้นขึ้น มันก็อาจจะเกิดจากไฟล์การกำหนดค่าบางอย่างที่ไม่ถูกต้อง เราขอแนะนำให้สำรองข้อมูลและการรีเซ็ตการตั้งค่าของคุณ. </ p>\n                    <p> การสำรองข้อมูลที่สามารถพบได้ในโฟลเดอร์การกำหนดค่า. </ p>\n                    <p> กรุณาส่งรายงานนี้ความผิดพลาดในการแก้ไขปัญหา. </ p>", "Send crash report to Ultimaker": "ส่งรายงานความผิดพลาดที่จะ Ultimaker", "Show detailed crash report": "แสดงรายละเอียดรายงานความผิดพลาด", "Show configuration folder": "แสดงโฟลเดอร์การกำหนดค่า", "Backup and Reset Configuration": "การกำหนดค่าการสำรองข้อมูลและการตั้งค่า", "Crash Report": "รายงานความผิดพลาด", "<p><b>A fatal error has occurred in Cura. Please send us this Crash Report to fix the problem</p></b>\n            <p>Please use the \"Send report\" button to post a bug report automatically to our servers</p>\n        ": "<p> <b> ข้อผิดพลาดร้ายแรงที่เกิดขึ้นใน Cura กรุณาส่งรายงานนี้ความผิดพลาดในการแก้ไขปัญหา </ p> </ b>\n            <p> โปรดใช้ปุ่ม \"รายงานส่ง\" เพื่อโพสต์รายงานข้อผิดพลาดโดยอัตโนมัติไปยังเซิร์ฟเวอร์ของเรา </ p>", "System information": "ข้อมูลระบบ", "Cura version": "รุ่นการดูแล", "Cura language": "ภาษาเขียน", "OS language": "ระบบปฏิบัติการภาษา", "Platform": "เวที", "Qt version": "รุ่น Qt", "PyQt version": "รุ่น PyQt", "OpenGL": "OpenGL", "Not yet initialized<br/>": "ยังไม่ได้เริ่มต้น <br/>", "<li>OpenGL Version: {version}</li>": "<li> OpenGL เวอร์ชัน: {} รุ่น </ li>", "<li>OpenGL Vendor: {vendor}</li>": "<> OpenGL ผู้ให้บริการ: {ผู้ขาย} </ li>", "<li>OpenGL Renderer: {renderer}</li>": "<li> OpenGL Renderer: {renderer} </ li>", "Error traceback": "traceback ข้อผิดพลาด", "Logs": "ท่อน", "User description (Note: Developers may not speak your language, please use English if possible)": "คำอธิบายของผู้ใช้ (หมายเหตุ: นักพัฒนาอาจจะไม่พูดภาษาของคุณกรุณาใช้ภาษาอังกฤษถ้าเป็นไปได้)", "Send report": "ส่งรายงาน", "File Already Exists": "ไฟล์อยู่แล้ว", "The file <filename>{0}</filename> already exists. Are you sure you want to overwrite it?": "แฟ้ม <ชื่อไฟล์> {0} </ filename> มีอยู่แล้ว คุณแน่ใจหรือว่าต้องการจะเขียนทับมันได้หรือไม่", "Invalid file URL:": "URL ของไฟล์ไม่ถูกต้อง:", "Not supported": "ได้รับการสนับสนุน", "Failed to export profile to <filename>{0}</filename>: <message>{1}</message>": "ล้มเหลวในการส่งออกไปยังรายละเอียด <ชื่อไฟล์> {0} </ filename> <ข้อความ> {1} </ ข้อความ>", "Failed to export profile to <filename>{0}</filename>: Writer plugin reported failure.": "ล้มเหลวในการส่งออกไปยังรายละเอียด <ชื่อไฟล์> {0} </ filename>: ปลั๊กอินเขียนรายงานความล้มเหลว", "Exported profile to <filename>{0}</filename>": "รายละเอียดการส่งออกไปยัง <ชื่อไฟล์> {0} </ filename>", "Export succeeded": "ส่งออกประสบความสำเร็จ", "Failed to import profile from <filename>{0}</filename>: {1}": "ล้มเหลวในการรายละเอียดที่นำเข้าจาก <ชื่อไฟล์> {0} </ filename>: {1}", "Can't import profile from <filename>{0}</filename> before a printer is added.": "ไม่สามารถนำรายละเอียดจาก <ชื่อไฟล์> {0} </ filename> ก่อนที่จะมีการเพิ่มเครื่องพิมพ์", "No custom profile to import in file <filename>{0}</filename>": "ไม่มีรายละเอียดที่กำหนดเองที่จะนำเข้าในแฟ้ม <ชื่อไฟล์> {0} </ filename>", "Failed to import profile from <filename>{0}</filename>:": "ล้มเหลวในการรายละเอียดที่นำเข้าจาก <ชื่อไฟล์> {0} </ filename>:", "This profile <filename>{0}</filename> contains incorrect data, could not import it.": "โปรไฟล์นี้ <ชื่อไฟล์> {0} </ filename> มีข้อมูลที่ไม่ถูกต้องไม่สามารถนำเข้า", "Successfully imported profile {0}": "รายละเอียดนำเข้าสำเร็จ {0}", "File {0} does not contain any valid profile.": "ไฟล์ {0} ไม่ได้มีรายละเอียดที่ถูกต้อง", "Profile {0} has an unknown file type or is corrupted.": "รายละเอียด {0} มีประเภทของไฟล์ที่ไม่รู้จักหรือได้รับความเสียหาย", "Custom profile": "โปรไฟล์ที่กำหนดเอง", "Profile is missing a quality type.": "ข้อมูลส่วนตัวจะหายไปชนิดที่มีคุณภาพ", "Could not find a quality type {0} for the current configuration.": "ไม่สามารถหาประเภทที่มีคุณภาพ {0} สำหรับการกำหนดค่าปัจจุบัน", "Settings have been changed to match the current availability of extruders:": "การตั้งค่ามีการเปลี่ยนแปลงเพื่อให้ตรงกับความพร้อมในปัจจุบันของ extruders:", "Settings updated": "การตั้งค่าการปรับปรุง", "Extruder(s) Disabled": "เครื่องอัดรีด (s) สำหรับผู้พิการ", "Finding new location for objects": "หาสถานที่ใหม่สำหรับวัตถุ", "Finding Location": "หาสถานที่ตั้ง", "Can't Find Location": "ไม่สามารถหาสถานที่ตั้ง", "The provided state is not correct.": "รัฐให้ไว้ไม่ถูกต้อง", "Please give the required permissions when authorizing this application.": "โปรดให้สิทธิ์ที่จำเป็นเมื่ออนุญาตให้โปรแกรมนี้", "Something unexpected happened when trying to log in, please try again.": "บางสิ่งบางอย่างที่ไม่คาดคิดเกิดขึ้นเมื่อพยายามที่จะเข้าสู่ระบบโปรดลองอีกครั้ง", "Unable to reach the Ultimaker account server.": "ไม่สามารถเข้าถึงเซิร์ฟเวอร์บัญชี Ultimaker", "Could not read response.": "ไม่สามารถอ่านการตอบสนอง", "Not connected to a printer": "ไม่ได้เชื่อมต่อกับเครื่องพิมพ์", "Printer does not accept commands": "เครื่องพิมพ์ไม่ยอมรับคำสั่ง", "In maintenance. Please check the printer": "ในการบำรุงรักษา กรุณาตรวจสอบเครื่องพิมพ์", "Lost connection with the printer": "การเชื่อมต่อที่หายไปพร้อมกับเครื่องพิมพ์", "Printing...": "พิมพ์ ...", "Paused": "หยุดชั่วคราว", "Preparing...": "การเตรียม...", "Please remove the print": "โปรดลบพิมพ์", "Pause": "หยุด", "Resume": "ประวัติย่อ", "Abort Print": "การทำแท้งพิมพ์", "Abort print": "พิมพ์ทำแท้ง", "Are you sure you want to abort the print?": "คุณแน่ใจว่าคุณต้องการที่จะยกเลิกการพิมพ์?", "Extruder": "extruder", "The target temperature of the hotend. The hotend will heat up or cool down towards this temperature. If this is 0, the hotend heating is turned off.": "อุณหภูมิเป้าหมายของ hotend hotend จะร้อนขึ้นหรือเย็นลงต่ออุณหภูมินี้ ในกรณีนี้คือ 0, ร้อน hotend ถูกปิด", "The current temperature of this hotend.": "อุณหภูมิปัจจุบันของ hotend นี้", "The temperature to pre-heat the hotend to.": "อุณหภูมิก่อนความร้อน hotend ไป", "Pre-heat": "Pre-ความร้อน", "Heat the hotend in advance before printing. You can continue adjusting your print while it is heating, and you won't have to wait for the hotend to heat up when you're ready to print.": "ความร้อน hotend ล่วงหน้าก่อนที่จะพิมพ์ คุณยังคงสามารถปรับการพิมพ์ของคุณในขณะที่มันเป็นความร้อน, และคุณจะไม่ต้องรอให้ hotend ร้อนขึ้นเมื่อคุณพร้อมที่จะพิมพ์", "The colour of the material in this extruder.": "สีของวัสดุในเครื่องอัดรีดนี้", "The material in this extruder.": "วัสดุที่ใช้ในเครื่องอัดรีดนี้", "The nozzle inserted in this extruder.": "หัวฉีดที่แทรกอยู่ในเครื่องอัดรีดนี้", "The printer is not connected.": "เครื่องพิมพ์ไม่ได้เชื่อมต่อ", "Build plate": "แผ่นรูปร่าง", "The target temperature of the heated bed. The bed will heat up or cool down towards this temperature. If this is 0, the bed heating is turned off.": "อุณหภูมิเป้าหมายของเตียงอุ่น เตียงจะร้อนขึ้นหรือเย็นลงต่ออุณหภูมินี้ ถ้านี้เป็น 0 ความร้อนเตียงถูกปิด", "The current temperature of the heated bed.": "อุณหภูมิปัจจุบันของเตียงอุ่น", "The temperature to pre-heat the bed to.": "อุณหภูมิก่อนความร้อนเตียงเพื่อ", "Heat the bed in advance before printing. You can continue adjusting your print while it is heating, and you won't have to wait for the bed to heat up when you're ready to print.": "ความร้อนเตียงล่วงหน้าก่อนที่จะพิมพ์ คุณยังคงสามารถปรับการพิมพ์ของคุณในขณะที่มันเป็นความร้อน, และคุณจะไม่ต้องรอให้เตียงร้อนขึ้นเมื่อคุณพร้อมที่จะพิมพ์", "Printer control": "ควบคุมเครื่องพิมพ์", "Jog Position": "Jog ตำแหน่ง", "X/Y": "X / Y", "Z": "กับ", "Jog Distance": "Jog ระยะทาง", "Send G-code": "ส่ง G-รหัส", "Send a custom G-code command to the connected printer. Press 'enter' to send the command.": "ส่งคำสั่งที่กำหนดเอง G-รหัสไปยังเครื่องพิมพ์ที่เชื่อมต่อ กด 'Enter' เพื่อส่งคำสั่ง", "This package will be installed after restarting.": "แพคเกจนี้จะถูกติดตั้งหลังจากรีสตาร์ท", "General": "ทั่วไป", "Settings": "การตั้งค่า", "Printers": "เครื่องพิมพ์", "Materials": "วัสดุ", "Profiles": "โปรไฟล์", "Closing Cura": "ปิด Cura", "Are you sure you want to exit Cura?": "คุณแน่ใจหรือว่าต้องการออกจาก Cura?", "Open file(s)": "เปิดไฟล์ (s)", "Install Package": "ติดตั้งแพคเกจ", "Open File(s)": "เปิดแฟ้ม (s)", "We have found one or more G-Code files within the files you have selected. You can only open one G-Code file at a time. If you want to open a G-Code file, please just select only one.": "เราพบมากกว่าหนึ่งไฟล์ G-Code ภายในไฟล์ที่คุณเลือก คุณสามารถยื่นเพียงเปิด G-Code ได้ตลอดเวลา หากคุณต้องการที่จะเปิดไฟล์ G-Code โปรดเลือกเพียงหนึ่ง", "Add Printer": "เพิ่มเครื่องพิมพ์", "What's New": "มีอะไรใหม่", "Untitled": "ไม่ได้ตั้งชื่อ", "Active print": "การพิมพ์ที่ใช้งานอยู่", "Job Name": "ชื่องาน", "Printing Time": "เวลาพิมพ์", "Estimated time left": "ประมาณเวลาที่เหลือ", "Slicing...": "หั่น ...", "Processing": "การประมวลผล", "Slice": "ชิ้น", "Start the slicing process": "เริ่มต้นกระบวนการหั่น", "Time estimation": "ประมาณเวลา", "Material estimation": "การประมาณค่าวัสดุ", "%1m": "1m%", "%1g": "% 1g", "No time estimation available": "ไม่มีการประมาณเวลาที่มีอยู่", "No cost estimation available": "ไม่มีประมาณค่าใช้จ่ายที่มีอยู่", "Print Selected Model With:": "พิมพ์ที่เลือกรุ่นด้วย:", "Multiply Selected Model": "เลือกคูณรุ่น", "Number of Copies": "จำนวนสำเนา", "&File": "&ไฟล์", "&Save...": "และบันทึก ...", "&Export...": "&ส่งออก...", "Export Selection...": "เลือกส่งออก ...", "Open &Recent": "เปิด & ล่าสุด", "Network enabled printers": "เครือข่ายเปิดการใช้งานเครื่องพิมพ์", "Local printers": "เครื่องพิมพ์ท้องถิ่น", "Configurations": "การกำหนดค่า", "Printer": "เครื่องพิมพ์", "Enabled": "เปิดการใช้งาน", "Material": "วัสดุ", "Use glue for better adhesion with this material combination.": "ใช้กาวสำหรับยึดเกาะที่ดีขึ้นด้วยการผสมผสานวัสดุนี้", "Loading available configurations from the printer...": "โหลดการกำหนดค่าที่มีอยู่จากเครื่องพิมพ์ ...", "The configurations are not available because the printer is disconnected.": "การกำหนดค่าที่ไม่สามารถใช้ได้เพราะเครื่องพิมพ์จะมีการตัดการเชื่อมต่อ", "Select configuration": "เลือกการกำหนดค่า", "This configuration is not available because %1 is not recognized. Please visit %2 to download the correct material profile.": "การกำหนดค่านี้ไม่สามารถใช้ได้เนื่องจาก% 1 ไม่เป็นที่รู้จัก กรุณาเยี่ยมชม% 2 เพื่อดาวน์โหลดรายละเอียดวัสดุที่ถูกต้อง", "Marketplace": "ตลาด", "&Settings": "และการตั้งค่า", "&Printer": "&เครื่องพิมพ์", "&Material": "&วัสดุ", "Set as Active Extruder": "ตั้งเป็นที่ใช้งาน Extruder", "Enable Extruder": "เปิดใช้งาน Extruder", "Disable Extruder": "ปิดการใช้งาน Extruder", "Favorites": "รายการโปรด", "Generic": "ทั่วไป", "&View": "&ดู", "&Camera position": "และตำแหน่งกล้อง", "Camera view": "มุมมองของกล้อง", "Perspective": "มุมมอง", "Orthographic": "orthographic", "&Build plate": "และแผ่นรูปร่าง", "Visible Settings": "การตั้งค่าที่มองเห็นได้", "Collapse All Categories": "ยุบทุกหมวดหมู่", "Manage Setting Visibility...": "จัดการการตั้งค่าการมองเห็น ...", "Calculated": "จากการคำนวณ", "Setting": "การตั้งค่า", "Profile": "ข้อมูลส่วนตัว", "Current": "ปัจจุบัน", "Unit": "หน่วย", "Setting Visibility": "การตั้งค่าการมองเห็น", "Check all": "ตรวจสอบทั้งหมด", "Filter...": "กรอง...", "Confirm Diameter Change": "ยืนยันการเปลี่ยนแปลงเส้นผ่านศูนย์กลาง", "The new filament diameter is set to %1 mm, which is not compatible with the current extruder. Do you wish to continue?": "เส้นผ่าศูนย์กลางเส้นใยใหม่ถูกตั้งค่าให้% 1 มิลลิเมตรซึ่งไม่เข้ากันได้กับเครื่องอัดรีดปัจจุบัน คุณต้องการดำเนินการต่อ", "Display Name": "ชื่อที่แสดง", "Brand": "ยี่ห้อ", "Material Type": "ประเภทวัสดุ", "Color": "สี", "Properties": "คุณสมบัติ", "Density": "ความหนาแน่น", "Diameter": "เส้นผ่าศูนย์กลาง", "Filament Cost": "ต้นทุนเส้นใย", "Filament weight": "น้ำหนักเส้นใย", "Filament length": "ความยาวเส้นใย", "Cost per Meter": "ค่าใช้จ่ายต่อ Meter", "This material is linked to %1 and shares some of its properties.": "วัสดุนี้จะเชื่อมโยงกับ% 1 และหุ้นบางส่วนของคุณสมบัติของมัน", "Unlink Material": "ยกเลิกการเชื่อมโยงวัสดุ", "Description": "ลักษณะ", "Adhesion Information": "ข้อมูลการยึดเกาะ", "Print settings": "ตั้งค่าการพิมพ์", "Activate": "เปิดใช้งาน", "Create": "สร้าง", "Duplicate": "ซ้ำ", "Remove": "ลบ", "Import": "นำเข้า", "Export": "ส่งออก", "Confirm Remove": "ยืนยันการลบ", "Are you sure you wish to remove %1? This cannot be undone!": "คุณแน่ใจหรือว่าต้องการลบ% 1? นี้ไม่สามารถยกเลิกได้!", "Import Material": "วัสดุนำเข้า", "Could not import material <filename>%1</filename>: <message>%2</message>": "ไม่สามารถนำเข้าวัสดุ <ชื่อไฟล์>% 1 </ filename> <ข้อความ>% 2 </ ข้อความ>", "Successfully imported material <filename>%1</filename>": "นำเข้าสำเร็จวัสดุ <ชื่อไฟล์>% 1 </ filename>", "Export Material": "วัสดุการส่งออก", "Failed to export material to <filename>%1</filename>: <message>%2</message>": "ล้มเหลวในการส่งออกไปยังวัสดุ <ชื่อไฟล์>% 1 </ filename> <ข้อความ>% 2 </ ข้อความ>", "Successfully exported material to <filename>%1</filename>": "ประสบความสำเร็จในการส่งออกวัสดุ <ชื่อไฟล์>% 1 </ filename>", "Rename": "เปลี่ยนชื่อ", "Create Profile": "สร้างโปรไฟล์", "Please provide a name for this profile.": "โปรดระบุชื่อสำหรับโปรไฟล์นี้", "Duplicate Profile": "ซ้ำข้อมูลส่วนตัว", "Rename Profile": "เปลี่ยนชื่อโปรไฟล์", "Import Profile": "รายละเอียดนำเข้า", "Export Profile": "รายละเอียดการส่งออก", "Printer: %1": "เครื่องพิมพ์:% 1", "Update profile with current settings/overrides": "รายละเอียดการปรับปรุงด้วยการตั้งค่าปัจจุบัน / แทนที่", "Discard current changes": "เปลี่ยนแปลงในปัจจุบันยกเลิก", "This profile uses the defaults specified by the printer, so it has no settings/overrides in the list below.": "รายละเอียดนี้จะใช้ค่าเริ่มต้นที่ระบุโดยเครื่องพิมพ์จึงมีไม่มีการตั้งค่า / แทนที่ในรายการด้านล่าง", "Your current settings match the selected profile.": "การตั้งค่าปัจจุบันของคุณตรงกับรูปแบบที่เลือก", "Global Settings": "การตั้งค่าส่วนกลาง", "Interface": "อินเตอร์เฟซ", "Language:": "ภาษา:", "Currency:": "สกุลเงิน:", "Theme:": "ธีม:", "You will need to restart the application for these changes to have effect.": "คุณจะต้องเริ่มต้นการประยุกต์ใช้สำหรับการเปลี่ยนแปลงเหล่านี้จะมีผลกระทบ", "Slice automatically when changing settings.": "Slice โดยอัตโนมัติเมื่อมีการเปลี่ยนแปลงการตั้งค่า", "Slice automatically": "Slice โดยอัตโนมัติ", "Viewport behavior": "พฤติกรรม viewport", "Highlight unsupported areas of the model in red. Without support these areas will not print properly.": "เน้นพื้นที่ที่ไม่สนับสนุนรูปแบบสีแดง โดยการสนับสนุนพื้นที่เหล่านี้จะไม่พิมพ์อย่างถูกต้อง", "Display overhang": "จอแสดงผลที่แขวนอยู่", "Moves the camera so the model is in the center of the view when a model is selected": "ย้ายกล้องเพื่อรูปแบบคือในใจกลางของมุมมองเมื่อรูปแบบที่ถูกเลือก", "Center camera when item is selected": "กล้องศูนย์เมื่อมีการเลือกรายการ", "Should the default zoom behavior of cura be inverted?": "ควรพฤติกรรมการซูมเริ่มต้นของ Cura จะกลับ?", "Invert the direction of camera zoom.": "สลับทิศทางของการซูมกล้อง", "Should zooming move in the direction of the mouse?": "ควรซูมย้ายในทิศทางของเมาส์หรือไม่", "Zooming towards the mouse is not supported in the orthographic perspective.": "ซูมต่อเมาส์ที่ไม่ได้รับการสนับสนุนในมุมมองของ orthographic", "Zoom toward mouse direction": "ซูมต่อทิศทางเมาส์", "Should models on the platform be moved so that they no longer intersect?": "รุ่นบนแพลตฟอร์มควรจะย้ายเพื่อให้พวกเขาไม่ตัด?", "Ensure models are kept apart": "ตรวจสอบให้แน่ใจรุ่นจะถูกเก็บไว้ออกจากกัน", "Should models on the platform be moved down to touch the build plate?": "รุ่นบนแพลตฟอร์มที่ควรจะเดินลงไปสัมผัสสร้างแผ่น?", "Automatically drop models to the build plate": "โดยอัตโนมัติวางรูปแบบการสร้างแผ่น", "Show caution message in g-code reader.": "ข้อความแสดงความระมัดระวังในการอ่านรหัส G-", "Caution message in g-code reader": "ข้อความข้อควรระวังในการอ่านรหัส G-", "Should layer be forced into compatibility mode?": "ควรชั้นถูกบังคับให้เข้าสู่โหมดความเข้ากันได้?", "Force layer view compatibility mode (restart required)": "กองทัพโหมดมุมมองชั้นความเข้ากันได้ (เริ่มต้นใหม่ที่จำเป็น)", "Should Cura open at the location it was closed?": "ควร Cura เปิดที่สถานที่ที่มันจะถูกปิด?", "Restore window position on start": "เรียกคืนตำแหน่งหน้าต่างในการเริ่มต้น", "What type of camera rendering should be used?": "สิ่งที่ประเภทของการแสดงผลของกล้องควรใช้?", "Camera rendering:": "การแสดงผลกล้อง:", "Opening and saving files": "เปิดและบันทึกไฟล์", "Should models be scaled to the build volume if they are too large?": "รุ่นควรจะปรับให้มีการสร้างปริมาณถ้าพวกเขามีขนาดใหญ่เกินไป?", "Scale large models": "Scale Models ขนาดใหญ่", "An model may appear extremely small if its unit is for example in meters rather than millimeters. Should these models be scaled up?": "รูปแบบอาจปรากฏมีขนาดเล็กมากถ้าหน่วยเป็นเช่นในเมตรมากกว่ามิลลิเมตร รูปแบบเหล่านี้ควรได้รับการปรับขนาดขึ้น?", "Scale extremely small models": "Scale Models มีขนาดเล็กมาก", "Should models be selected after they are loaded?": "รุ่นควรจะเลือกหลังจากที่พวกเขาจะเต็มไป?", "Select models when loaded": "เลือกรุ่นเมื่อโหลด", "Should a prefix based on the printer name be added to the print job name automatically?": "ควรอยู่บนพื้นฐานของคำนำหน้าชื่อเครื่องพิมพ์ถูกเพิ่มเข้าไปในชื่องานพิมพ์โดยอัตโนมัติ?", "Add machine prefix to job name": "เพิ่มคำนำหน้าเครื่องชื่องาน", "Should a summary be shown when saving a project file?": "ควรสรุปจะแสดงเมื่อมีการบันทึกแฟ้มโครงการหรือไม่?", "Show summary dialog when saving project": "แสดงโต้ตอบสรุปเมื่อมีการบันทึกโครงการ", "Default behavior when opening a project file": "พฤติกรรมเริ่มต้นเมื่อเปิดไฟล์โครงการ", "Default behavior when opening a project file: ": "เริ่มต้นพฤติกรรมเมื่อเปิดไฟล์โครงการ:", "Always ask me this": "มักจะถามฉันนี้", "Always open as a project": "เปิดเสมอเป็นโครงการ", "Always import models": "รุ่นนำเข้าเสมอ", "When you have made changes to a profile and switched to a different one, a dialog will be shown asking whether you want to keep your modifications or not, or you can choose a default behaviour and never show that dialog again.": "เมื่อคุณได้ทำการเปลี่ยนแปลงรายละเอียดและเปลี่ยนไปที่แตกต่างกันหนึ่งโต้ตอบจะแสดงถามว่าคุณต้องการที่จะให้มีการปรับเปลี่ยนของคุณหรือไม่หรือคุณสามารถเลือกการทำงานเริ่มต้นและไม่เคยแสดงโต้ตอบที่อีกครั้ง", "Default behavior for changed setting values when switching to a different profile: ": "พฤติกรรมเริ่มต้นสำหรับค่าการตั้งค่าการเปลี่ยนแปลงเมื่อเปลี่ยนรายละเอียดที่แตกต่างกัน:", "Always discard changed settings": "การตั้งค่าการเปลี่ยนแปลงเสมอทิ้ง", "Always transfer changed settings to new profile": "เสมอโอนการตั้งค่าการเปลี่ยนแปลงไปยังโปรไฟล์ใหม่", "Privacy": "ความเป็นส่วนตัว", "Should Cura check for updates when the program is started?": "ควร Cura ตรวจสอบการปรับปรุงเมื่อโปรแกรมเริ่มต้น?", "Check for updates on start": "ตรวจหาการปรับปรุงในการเริ่มต้น", "Should anonymous data about your print be sent to Ultimaker? Note, no models, IP addresses or other personally identifiable information is sent or stored.": "ข้อมูลที่ควรระบุชื่อเกี่ยวกับการพิมพ์ของคุณถูกส่งไปยัง Ultimaker? หมายเหตุไม่มีรูปแบบที่อยู่ IP หรือข้อมูลส่วนบุคคลอื่น ๆ จะถูกส่งหรือเก็บไว้", "Send (anonymous) print information": "ส่ง (ไม่ระบุชื่อ) พิมพ์ข้อมูล", "More information": "ข้อมูลมากกว่านี้", "View type": "ดูประเภท", "Object list": "รายการวัตถุ", "There is no printer found over your network.": "มีเครื่องพิมพ์ไม่พบผ่านเครือข่ายของคุณ", "Refresh": "รีเฟรช", "Add printer by IP": "เพิ่มเครื่องพิมพ์โดย IP", "Troubleshooting": "การแก้ไขปัญหา", "Ultimaker Cloud": "Ultimaker เมฆ", "The next generation 3D printing workflow": "รุ่นต่อไปเวิร์กโฟลว์การพิมพ์ 3 มิติ", "- Send print jobs to Ultimaker printers outside your local network": "- งานส่งพิมพ์ไปยังเครื่องพิมพ์ Ultimaker นอกเครือข่ายท้องถิ่นของคุณ", "- Store your Ultimaker Cura settings in the cloud for use anywhere": "- เก็บการตั้งค่า Ultimaker Cura คุณในเมฆสำหรับการใช้งานได้ทุกที่", "- Get exclusive access to print profiles from leading brands": "- รับสิทธิ์พิเศษในการพิมพ์โปรไฟล์จากแบรนด์ชั้นนำ", "Finish": "เสร็จสิ้น", "Create an account": "สร้างบัญชี", "Sign in": "เข้าสู่ระบบ", "Add printer by IP address": "เพิ่มเครื่องพิมพ์ตามที่อยู่ IP", "Enter the IP address of your printer on the network.": "ใส่ที่อยู่ IP ของเครื่องพิมพ์ของคุณบนเครือข่าย", "Place enter your printer's IP address.": "สถานที่ป้อนที่อยู่ IP ของเครื่องพิมพ์", "Please enter a valid IP address.": "โปรดป้อนที่อยู่ IP ที่ถูกต้อง", "Could not connect to device.": "ไม่สามารถเชื่อมต่อกับอุปกรณ์", "The printer at this address has not responded yet.": "เครื่องพิมพ์ที่อยู่นี้ไม่ได้ตอบสนองเลย", "This printer cannot be added because it's an unknown printer or it's not the host of a group.": "เครื่องพิมพ์นี้ไม่สามารถเพิ่มเพราะมันเป็นเครื่องพิมพ์ที่ไม่รู้จักหรือไม่โฮสต์ของกลุ่ม", "Type": "ชนิด", "Firmware version": "รุ่นเฟิร์มแว", "Address": "ที่อยู่", "Back": "กลับ", "Connect": "เชื่อมต่อ", "Help us to improve Ultimaker Cura": "ช่วยให้เราสามารถปรับปรุง Ultimaker Cura", "Ultimaker Cura collects anonymous data to improve print quality and user experience, including:": "Ultimaker Cura เก็บรวบรวมข้อมูลที่ไม่ระบุชื่อในการปรับปรุงคุณภาพการพิมพ์และประสบการณ์ของผู้ใช้รวมไปถึง:", "Machine types": "ประเภทเครื่อง", "Material usage": "การใช้วัสดุ", "Number of slices": "จำนวนชิ้น", "Data collected by Ultimaker Cura will not contain any personal information.": "ข้อมูลที่เก็บรวบรวมโดย Ultimaker Cura จะไม่มีข้อมูลส่วนบุคคลใด ๆ", "Add a printer": "เพิ่มเครื่องพิมพ์", "Add a networked printer": "เพิ่มเครื่องพิมพ์เครือข่าย", "Add a non-networked printer": "เพิ่มเครื่องพิมพ์ที่ไม่ใช่เครือข่าย", "User Agreement": "ข้อตกลงการใช้", "Decline and close": "ลดลงและใกล้", "Printer name": "ชื่อเครื่องพิมพ์", "Please give your printer a name": "กรุณาให้ชื่อเครื่องพิมพ์ของคุณ", "Empty": "ว่างเปล่า", "What's new in Ultimaker Cura": "มีอะไรใหม่ใน Ultimaker Cura", "Welcome to Ultimaker Cura": "ยินดีต้อนรับสู่ Ultimaker Cura", "Please follow these steps to set up\nUltimaker Cura. This will only take a few moments.": "โปรดปฏิบัติตามขั้นตอนเหล่านี้ในการตั้งค่า\nUltimaker Cura นี้จะใช้เวลาสักครู่", "Add printer": "เพิ่มเครื่องพิมพ์", "Manage printers": "จัดการเครื่องพิมพ์", "Connected printers": "เครื่องพิมพ์ที่เชื่อมต่อ", "Preset printers": "เครื่องพิมพ์ที่ตั้งไว้ล่วงหน้า", "Print Selected Model with %1": "พิมพ์ที่เลือกรุ่นกับ% 1", "3D View": "มุมมอง 3 มิติ", "Front View": "มุมมองด้านหน้า", "Top View": "มุมมองด้านบน", "Left View": "มุมมองซ้าย", "Right View": "ขวาดู", "Some setting/override values are different from the values stored in the profile.\n\nClick to open the profile manager.": "บางคนตั้งค่า / ค่าแทนที่จะแตกต่างจากค่าที่เก็บไว้ในรายละเอียด\n\nคลิ๊กเพื่อเปิดตัวจัดการรายละเอียด", "On": "บน", "Off": "ปิด", "Experimental": "การทดลอง", "There is no %1 profile for the configuration in extruder %2. The default intent will be used instead": "ไม่มี% 1 รายละเอียดสำหรับการกำหนดค่าในเครื่องอัดรีด% 2 คือ ความตั้งใจที่จะเริ่มต้นจะถูกนำมาใช้แทน", "Generate structures to support parts of the model which have overhangs. Without these structures, such parts would collapse during printing.": "สร้างโครงสร้างเพื่อสนับสนุนชิ้นส่วนของรูปแบบที่มีการยื่น โดยไม่ต้องโครงสร้างเหล่านี้ชิ้นส่วนดังกล่าวจะยุบในระหว่างการพิมพ์", "Gradual infill": "infill ค่อยเป็นค่อยไป", "Gradual infill will gradually increase the amount of infill towards the top.": "infill ค่อยเป็นค่อยไปจะค่อยๆเพิ่มปริมาณของ infill ที่มีต่อด้านบน", "You have modified some profile settings. If you want to change these go to custom mode.": "คุณได้แก้ไขการตั้งค่าโปรไฟล์บาง หากคุณต้องการที่จะเปลี่ยนไปเหล่านี้ไปยังโหมดที่กำหนดเอง", "Adhesion": "ความศรัทธา", "Enable printing a brim or raft. This will add a flat area around or under your object which is easy to cut off afterwards.": "เปิดใช้งานการพิมพ์ปีกหรือแพ นี้จะเพิ่มพื้นที่ราบไปรอบ ๆ หรือภายใต้วัตถุของคุณซึ่งเป็นเรื่องง่ายที่จะตัดหลังจากนั้น", "Print setup disabled. G-code file can not be modified.": "การตั้งค่าปิดการใช้งานพิมพ์ ไฟล์ G-รหัสไม่สามารถแก้ไขได้", "Some hidden settings use values different from their normal calculated value.\n\nClick to make these settings visible.": "การตั้งค่าซ่อนบางคนใช้ค่าที่แตกต่างจากค่าที่คำนวณได้ตามปกติ\n\nคลิ๊กเพื่อทำการตั้งค่าเหล่านี้สามารถมองเห็นได้", "Search settings": "ตั้งค่าการค้นหา", "Copy value to all extruders": "ค่าคัดลอกไป extruders ทั้งหมด", "Copy all changed values to all extruders": "คัดลอกค่าการเปลี่ยนแปลงทั้งหมดที่จะ extruders ทั้งหมด", "Hide this setting": "ซ่อนการตั้งค่านี้", "Don't show this setting": "ไม่ต้องแสดงการตั้งค่านี้", "Keep this setting visible": "เก็บการตั้งค่านี้สามารถมองเห็นได้", "Configure setting visibility...": "การกำหนดค่าการแสดงผลการตั้งค่า ...", "This setting is not used because all the settings that it influences are overridden.": "การตั้งค่านี้จะไม่ได้ใช้เพราะการตั้งค่าทั้งหมดที่มีอิทธิพลนั้นจะถูกแทนที่", "Affects": "ส่งผลกระทบต่อ", "Affected By": "รับผลกระทบจาก", "This setting is always shared between all extruders. Changing it here will change the value for all extruders.": "การตั้งค่านี้เสมอกันระหว่าง extruders ทั้งหมด เปลี่ยนได้ที่นี่จะมีการเปลี่ยนแปลงค่าสำหรับ extruders ทั้งหมด", "The value is resolved from per-extruder values ": "ค่าที่ได้รับการแก้ไขจากค่าต่อการอัดรีด", "This setting has a value that is different from the profile.\n\nClick to restore the value of the profile.": "การตั้งค่านี้มีค่าที่แตกต่างจากรายละเอียดที่\n\nคลิ๊กเพื่อเรียกคืนค่าของรายละเอียดที่", "This setting is normally calculated, but it currently has an absolute value set.\n\nClick to restore the calculated value.": "การตั้งค่านี้จะคำนวณได้ตามปกติ แต่ขณะนี้มีชุดค่าสัมบูรณ์\n\nคลิ๊กเพื่อเรียกคืนค่าการคำนวณ", "- Send print jobs to Ultimaker printers outside your local network\n- Store your Ultimaker Cura settings in the cloud for use anywhere\n- Get exclusive access to print profiles from leading brands": "- งานส่งพิมพ์ไปยังเครื่องพิมพ์ Ultimaker นอกเครือข่ายท้องถิ่นของคุณ\n- เก็บการตั้งค่า Ultimaker Cura คุณในเมฆสำหรับการใช้งานได้ทุกที่\n- รับสิทธิ์พิเศษในการพิมพ์โปรไฟล์จากแบรนด์ชั้นนำ", "Create account": "สร้างบัญชี", "Hi %1": "สวัสดี% 1", "Ultimaker account": "บัญชี Ultimaker", "Sign out": "ออกจากระบบ", "About ": "เกี่ยวกับ", "version: %1": "รุ่น:% 1", "End-to-end solution for fused filament 3D printing.": "โซลูชั่นแบบ end-to-end สำหรับผสมใยพิมพ์ 3 มิติ", "Cura is developed by Ultimaker B.V. in cooperation with the community.\nCura proudly uses the following open source projects:": "Cura จะถูกพัฒนาโดย Ultimaker B.V. ในความร่วมมือกับชุมชน\nCura ภูมิใจใช้มาเปิดโครงการต่อไปนี้:", "Graphical user interface": "อินเตอร์เฟซผู้ใช้แบบกราฟิก", "Application framework": "การประยุกต์ใช้กรอบ", "G-code generator": "G-รหัสเครื่องกำเนิดไฟฟ้า", "Interprocess communication library": "ห้องสมุดการสื่อสาร", "Programming language": "การเขียนโปรแกรมภาษา", "GUI framework": "กรอบ GUI", "GUI framework bindings": "GUI ผูกกรอบ", "C/C++ Binding library": "C / C ++ ห้องสมุดเข้าเล่ม", "Data interchange format": "รูปแบบการแลกเปลี่ยนข้อมูล", "Support library for scientific computing": "ห้องสมุดการสนับสนุนสำหรับการคำนวณทางวิทยาศาสตร์", "Support library for faster math": "ห้องสมุดการสนับสนุนสำหรับคณิตศาสตร์ได้เร็วขึ้น", "Support library for handling STL files": "ห้องสมุดการสนับสนุนสำหรับการจัดการไฟล์ STL", "Support library for handling planar objects": "ห้องสมุดการสนับสนุนสำหรับการจัดการวัตถุระนาบ", "Support library for handling triangular meshes": "ห้องสมุดการสนับสนุนสำหรับการจัดการตาข่ายสามเหลี่ยม", "Support library for analysis of complex networks": "ห้องสมุดการสนับสนุนสำหรับการวิเคราะห์เครือข่ายที่ซับซ้อน", "Support library for handling 3MF files": "สนับสนุนห้องสมุดสำหรับการจัดการไฟล์ 3MF", "Support library for file metadata and streaming": "ห้องสมุดการสนับสนุนสำหรับเมตาดาต้าไฟล์และการสตรีมมิ่ง", "Serial communication library": "ห้องสมุดการสื่อสารแบบอนุกรม", "ZeroConf discovery library": "ห้องสมุดการค้นพบ ZeroConf", "Polygon clipping library": "ห้องสมุดตัดรูปหลายเหลี่ยม", "Python HTTP library": "ห้องสมุดหลาม HTTP", "Font": "ตัวอักษร", "SVG icons": "ไอคอน SVG", "Linux cross-distribution application deployment": "ลินุกซ์ใช้งานโปรแกรมข้ามกระจาย", "Discard or Keep changes": "ยกเลิกหรือเก็บการเปลี่ยนแปลง", "You have customized some profile settings.\nWould you like to keep or discard those settings?": "คุณมีการปรับแต่งการตั้งค่าโปรไฟล์บาง\nคุณต้องการที่จะเก็บหรือทิ้งการตั้งค่าเหล่านั้นหรือไม่", "Profile settings": "การตั้งค่าโปรไฟล์", "Customized": "ที่กำหนดเอง", "Discard and never ask again": "ยกเลิกและไม่เคยถามอีก", "Keep and never ask again": "เก็บและไม่เคยถามอีก", "Discard": "ยกเลิก", "Keep": "เก็บ", "Create New Profile": "สร้างโปรไฟล์ใหม่", "We have found one or more project file(s) within the files you have selected. You can open only one project file at a time. We suggest to only import models from those files. Would you like to proceed?": "เราพบหนึ่งหรือแฟ้มโครงการมากขึ้น (s) ภายในไฟล์ที่คุณเลือก คุณสามารถเปิดไฟล์เพียงหนึ่งโครงการในเวลา เราขอแนะนำให้กับรุ่นนำเข้าจากไฟล์เหล่านั้น คุณต้องการที่จะดำเนินการอย่างไร", "Import all as models": "นำเข้าทุกรุ่น", "Open project file": "แฟ้มโครงการเปิด", "This is a Cura project file. Would you like to open it as a project or import the models from it?": "นี้เป็นไฟล์โครงการ Cura คุณต้องการที่จะเปิดเป็นโครงการหรือนำเข้ารุ่นจากมันได้หรือไม่", "Remember my choice": "จดจำตัวเลือกของฉัน", "Open as project": "เปิดเป็นโครงการ", "Import models": "นำเข้ารุ่น", "Save Project": "บันทึกโครงการ", "Summary - Cura Project": "ข้อมูลอย่างย่อ - Cura โครงการ", "Printer settings": "การตั้งค่าเครื่องพิมพ์", "Printer Group": "กลุ่มเครื่องพิมพ์", "Name": "ชื่อ", "Extruder %1": "Extruder% 1", "%1 & material": "% 1 และวัสดุ", "Not in profile": "ไม่ได้อยู่ในรายละเอียด", "%1 override": "% 1 แทนที่", "Intent": "เจตนา", "Don't show project summary on save again": "ไม่ต้องแสดงสรุปโครงการประหยัดอีกครั้ง", "Save": "บันทึก", "&Edit": "และแก้ไข", "E&xtensions": "E & XTensions", "P&references": "P & อ้างอิง", "&Help": "&ช่วยด้วย", "New project": "โครงการใหม่", "Are you sure you want to start a new project? This will clear the build plate and any unsaved settings.": "คุณแน่ใจหรือไม่ว่าต้องการที่จะเริ่มโครงการใหม่หรือไม่? นี้จะล้างจานสร้างและการตั้งค่าใด ๆ ที่ไม่ได้บันทึก", "Show Online Troubleshooting Guide": "แสดงคู่มือการแก้ไขปัญหาออนไลน์", "Toggle Full Screen": "หน้าจอสลับเต็ม", "Exit Full Screen": "ออกจากเต็มหน้าจอ", "&Undo": "และเลิกทำ", "&Redo": "และพร้อม", "&Quit": "&เลิก", "Left Side View": "ซ้ายมุมมองด้านข้าง", "Right Side View": "ด้านขวาดู", "Configure Cura...": "กำหนดค่า Cura ...", "&Add Printer...": "และเพิ่มเครื่องพิมพ์ ...", "Manage Pr&inters...": "และการจัดการ Interac ...", "Manage Materials...": "จัดการวัสดุ ...", "Add more materials from Marketplace": "เพิ่มวัสดุอื่น ๆ จากตลาด", "&Update profile with current settings/overrides": "และรายละเอียดการปรับปรุงด้วยการตั้งค่าปัจจุบัน / แทนที่", "&Discard current changes": "และเปลี่ยนแปลงในปัจจุบันยกเลิก", "&Create profile from current settings/overrides...": "และสร้างรายได้จากการตั้งค่าปัจจุบัน / แทนที่ ...", "Manage Profiles...": "จัดการส่วนกำหนดค่า ...", "Show Online &Documentation": "แสดงเอกสารออนไลน์", "Report a &Bug": "รายงานความผิดพลาด", "About...": "เกี่ยวกับ ...", "Delete Selected Model": "ลบที่เลือกรุ่น", "Center Selected Model": "ศูนย์เลือกรุ่น", "Delete Model": "ลบรุ่น", "Ce&nter Model on Platform": "ศูนย์กลางการหมุนรุ่นบนแพลทฟอร์ม", "&Group Models": "และกลุ่มรุ่น", "Ungroup Models": "ยกเลิกการจัดกลุ่มรุ่น", "&Merge Models": "และผสานรุ่น", "&Multiply Model...": "และคูณรุ่น ...", "Select All Models": "เลือกทุกรุ่น", "Clear Build Plate": "จานรูปร่างที่ชัดเจน", "Reload All Models": "รุ่นโหลดทั้งหมด", "Arrange All Models To All Build Plates": "จัดทุกรุ่นเพื่อแผ่นรูปร่างทั้งหมด", "Arrange All Models": "จัดทุกรุ่น", "Arrange Selection": "จัดให้มีการคัดเลือก", "Reset All Model Positions": "รีเซ็ตทุกรุ่นตำแหน่ง", "Reset All Model Transformations": "รีเซ็ตทุกรุ่นแปลง", "&Open File(s)...": "และเปิดไฟล์ (s) ...", "&New Project...": "&โครงการใหม่...", "Show Configuration Folder": "แสดงการกำหนดค่าโฟลเดอร์", "&Marketplace": "และตลาด", "More information on anonymous data collection": "ข้อมูลเพิ่มเติมเกี่ยวกับการเก็บรวบรวมข้อมูลที่ไม่ระบุชื่อ", "Ultimaker Cura collects anonymous data in order to improve the print quality and user experience. Below is an example of all the data that is shared:": "Ultimaker Cura เก็บรวบรวมข้อมูลที่ไม่ระบุชื่อเพื่อปรับปรุงคุณภาพการพิมพ์และประสบการณ์ของผู้ใช้ ด้านล่างเป็นตัวอย่างของข้อมูลทั้งหมดที่ใช้ร่วมกัน:", "I don't want to send anonymous data": "ฉันไม่ต้องการที่จะส่งข้อมูลที่ไม่ระบุชื่อ", "Allow sending anonymous data": "อนุญาตให้ส่งข้อมูลที่ไม่ระบุชื่อ", "OK": "ตกลง", "Convert Image...": "แปลงภาพ ...", "The maximum distance of each pixel from \"Base.\"": "ระยะทางสูงสุดของแต่ละพิกเซลจาก \"ฐาน\".", "Height (mm)": "ความสูง (mm)", "The base height from the build plate in millimeters.": "ความสูงจากฐานการสร้างแผ่นมิลลิเมตร", "Base (mm)": "ฐาน (mm)", "The width in millimeters on the build plate.": "ความกว้างในหน่วยมิลลิเมตรในการสร้างแผ่น", "Width (mm)": "ความกว้าง (mm)", "The depth in millimeters on the build plate": "ความลึกในหน่วยมิลลิเมตรในการสร้างแผ่น", "Depth (mm)": "ความลึก (mm)", "For lithophanes dark pixels should correspond to thicker locations in order to block more light coming through. For height maps lighter pixels signify higher terrain, so lighter pixels should correspond to thicker locations in the generated 3D model.": "สำหรับ lithophanes พิกเซลสีเข้มควรตรงไปยังสถานที่หนาเพื่อป้องกันแสงมากขึ้นที่ผ่านมาทาง สำหรับความสูงของแผนที่พิกเซลน้ำหนักเบามีความหมายภูมิประเทศที่สูงขึ้นพิกเซลเพื่อให้มีน้ำหนักเบาควรตรงไปยังสถานที่หนาในรูปแบบ 3 มิติที่สร้างขึ้น", "Darker is higher": "เข้มเป็นที่สูงขึ้น", "Lighter is higher": "เบาจะสูงกว่า", "For lithophanes a simple logarithmic model for translucency is available. For height maps the pixel values correspond to heights linearly.": "สำหรับ lithophanes รูปแบบลอการิทึมง่ายสำหรับ translucency ใช้ได้ สำหรับความสูงของแผนที่ค่าพิกเซลสอดคล้องกับความสูงเป็นเส้นตรง", "Linear": "เชิงเส้น", "Translucency": "translucency", "The percentage of light penetrating a print with a thickness of 1 millimeter. Lowering this value increases the contrast in dark regions and decreases the contrast in light regions of the image.": "ร้อยละของแสงเจาะพิมพ์ที่มีความหนา 1 มิลลิเมตร ลดค่านี้เพิ่มความคมชัดในภูมิภาคที่มืดและลดความคมชัดในภูมิภาคแสงของภาพ", "1mm Transmittance (%)": "1mm ส่งผ่าน (%)", "The amount of smoothing to apply to the image.": "จำนวนเงินที่ราบเรียบที่จะนำไปใช้กับภาพ", "Smoothing": "การขจัดอุปสรรค", "Nozzle Settings": "การตั้งค่าหัวฉีด", "Nozzle size": "ขนาดหัวฉีด", "mm": "มิลลิเมตร", "Compatible material diameter": "เส้นผ่าศูนย์กลางวัสดุที่เข้ากันได้", "Nozzle offset X": "หัวฉีดชดเชย X", "Nozzle offset Y": "หัวฉีดชดเชย Y", "Cooling Fan Number": "คูลลิ่งจำนวนพัดลม", "Extruder Start G-code": "Extruder เริ่มต้น G-รหัส", "Extruder End G-code": "Extruder End G-รหัส", "Printer Settings": "การตั้งค่าเครื่องพิมพ์", "X (Width)": "X (ความกว้าง)", "Y (Depth)": "และ (ความลึก)", "Z (Height)": "Z (สูง)", "Build plate shape": "รูปร่างแผ่นรูปร่าง", "Origin at center": "แหล่งที่มาที่ศูนย์", "Heated bed": "เตียงอุ่น", "Heated build volume": "ปริมาณการสร้างความร้อน", "G-code flavor": "G-รหัสรสชาติ", "Printhead Settings": "การตั้งค่าสุงสุด", "X min": "X นาที", "Y min": "Y นาที", "X max": "X สูงสุด", "Y max": "และแม็กซ์", "Gantry Height": "Gantry สูง", "Number of Extruders": "จำนวน Extruders", "Shared Heater": "เครื่องทำน้ำอุ่นที่ใช้ร่วมกัน", "Start G-code": "เริ่มต้น G-รหัส", "End G-code": "End G-รหัส", "Compatibility": "ความเข้ากันได้", "Machine": "เครื่อง", "Build Plate": "จานรูปร่าง", "Quality": "คุณภาพ", "Technical Data Sheet": "เอกสารข้อมูลทางเทคนิค", "Safety Data Sheet": "เอกสารข้อมูลความปลอดภัย", "Printing Guidelines": "แนวทางการพิมพ์", "Website": "เว็บไซต์", "ratings": "การจัดอันดับ", "Will install upon restarting": "จะติดตั้งอยู่กับการเริ่มต้นใหม่", "Update": "ปรับปรุง", "Updating": "อัปเดต", "Updated": "Updated", "<a href='%1'>Log in</a> is required to update": "<a href='%1'> เข้าสู่ระบบ </a> จำเป็นต้องมีการปรับปรุง", "Downgrade": "มือตก", "Uninstall": "ถอนการติดตั้ง", "You will need to restart Cura before changes in packages have effect.": "คุณจะต้องเริ่มต้นใหม่ Cura ก่อนการเปลี่ยนแปลงในแพคเกจที่มีผลกระทบ", "Quit Cura": "คอเลสเตอรอลออกจาก", "You need to login first before you can rate": "คุณจำเป็นต้องเข้าสู่ระบบก่อนจึงจะสามารถประเมิน", "You need to install the package before you can rate": "คุณต้องติดตั้งแพคเกจก่อนที่คุณจะสามารถให้คะแนน", "Featured": "แนะนำ", "Go to Web Marketplace": "ไปที่ตลาดเว็บ", "Search materials": "วัสดุที่ค้นหา", "Installed": "การติดตั้ง", "<a href='%1'>Log in</a> is required to install or update": "<a href='%1'> เข้าสู่ระบบ </a> จำเป็นต้องมีการติดตั้งหรือปรับปรุง", "<a href='%1'>Buy material spools</a>": "<a href='%1'> ซื้อหลอดวัสดุ </a>", "Install": "ติดตั้ง", "Plugins": "ปลั๊กอิน", "Changes from your account": "การเปลี่ยนแปลงจากบัญชีของคุณ", "Dismiss": "ยกเลิก", "The following packages will be added:": "แพคเกจต่อไปนี้จะเพิ่ม:", "The following packages can not be installed because of an incompatible Cura version:": "แพคเกจดังต่อไปนี้ไม่สามารถติดตั้งเพราะรุ่น Cura เข้ากันไม่ได้:", "You need to accept the license to install the package": "คุณต้องยอมรับใบอนุญาตในการติดตั้งแพคเกจ", "Confirm uninstall": "ถอนการติดตั้งการยืนยัน", "You are uninstalling materials and/or profiles that are still in use. Confirming will reset the following materials/profiles to their defaults.": "คุณถอนการติดตั้งวัสดุและ / หรือ profiles ที่ยังใช้งานอยู่ ยืนยันจะตั้งค่าดังต่อไปนี้ / วัสดุโปรไฟล์เป็นค่าเริ่มต้นของพวกเขา", "Confirm": "ยืนยัน", "Your rating": "คะแนนของคุณ", "Version": "รุ่น", "Last updated": "อัพเดทล่าสุด", "Author": "ผู้เขียน", "Downloads": "ดาวน์โหลด", "Get plugins and materials verified by Ultimaker": "รับปลั๊กอินและวัสดุการตรวจสอบโดย Ultimaker", "Community Contributions": "การมีส่วนร่วมของชุมชน", "Community Plugins": "ปลั๊กอินชุมชน", "Generic Materials": "วัสดุทั่วไป", "Could not connect to the Cura Package database. Please check your connection.": "ไม่สามารถเชื่อมต่อกับฐานข้อมูล Cura แพคเกจ กรุณาตรวจสอบการเชื่อมต่อของคุณ", "Email": "อีเมล์", "Fetching packages...": "แพคเกจการดึงข้อมูล ...", "Build Plate Leveling": "Leveling รูปร่างจาน", "To make sure your prints will come out great, you can now adjust your buildplate. When you click 'Move to Next Position' the nozzle will move to the different positions that can be adjusted.": "เพื่อให้แน่ใจว่าการพิมพ์ของคุณจะออกมาดีตอนนี้คุณสามารถปรับ buildplate ของคุณ เมื่อคุณคลิก 'ย้ายไปยังตำแหน่งถัดไป' หัวฉีดจะย้ายไปตำแหน่งที่แตกต่างที่สามารถปรับเปลี่ยนได้", "For every position; insert a piece of paper under the nozzle and adjust the print build plate height. The print build plate height is right when the paper is slightly gripped by the tip of the nozzle.": "สำหรับทุกตำแหน่ง; ใส่ชิ้นส่วนของกระดาษภายใต้หัวฉีดและปรับความสูงพิมพ์สร้างแผ่น ความสูงพิมพ์สร้างแผ่นที่ถูกต้องเมื่อกระดาษถูกจับเล็กน้อยปลายของหัวฉีด", "Start Build Plate Leveling": "Leveling เริ่มต้นการสร้างแผ่น", "Move to Next Position": "ย้ายไปยังตำแหน่งถัดไป", "Please select any upgrades made to this Ultimaker Original": "กรุณาเลือกอัพเกรดใด ๆ ที่ทำนี้ Ultimaker ต้นฉบับ", "Heated Build Plate (official kit or self-built)": "อุ่นรูปร่างแผ่น (ชุดอย่างเป็นทางการหรือสร้างขึ้นด้วยตนเอง)", "Connect to Networked Printer": "เชื่อมต่อกับเครือข่ายเครื่องพิมพ์", "To print directly to your printer over the network, please make sure your printer is connected to the network using a network cable or by connecting your printer to your WIFI network. If you don't connect Cura with your printer, you can still use a USB drive to transfer g-code files to your printer.": "หากต้องการพิมพ์โดยตรงไปยังเครื่องพิมพ์ของคุณผ่านเครือข่ายโปรดให้แน่ใจว่าเครื่องพิมพ์ของคุณเชื่อมต่อกับเครือข่ายโดยใช้สายเคเบิลเครือข่ายหรือโดยการเชื่อมต่อเครื่องพิมพ์เข้ากับเครือข่าย WIFI ของคุณ หากคุณไม่ได้เชื่อมต่อ Cura กับเครื่องพิมพ์ของคุณคุณยังสามารถใช้ไดรฟ์ USB เพื่อการถ่ายโอนไฟล์กรัมรหัสกับเครื่องพิมพ์ของคุณ", "Select your printer from the list below:": "เลือกเครื่องพิมพ์ของคุณจากรายการด้านล่าง:", "Edit": "แก้ไข", "If your printer is not listed, read the <a href='%1'>network printing troubleshooting guide</a>": "หากเครื่องพิมพ์ของคุณไม่อยู่ในรายการเครือข่ายอ่าน <a href='%1'> พิมพ์คู่มือการแก้ปัญหา </a>", "This printer is not set up to host a group of printers.": "เครื่องพิมพ์นี้ไม่ได้ตั้งค่าให้เป็นเจ้าภาพจัดการกลุ่มเครื่องพิมพ์", "This printer is the host for a group of %1 printers.": "เครื่องพิมพ์นี้เป็นเจ้าภาพสำหรับกลุ่มของเครื่องพิมพ์% 1", "The printer at this address has not yet responded.": "เครื่องพิมพ์ที่อยู่นี้ยังไม่ได้ตอบ", "Invalid IP address": "ที่อยู่ IP ไม่ถูกต้อง", "Printer Address": "ที่อยู่เครื่องพิมพ์", "Unavailable printer": "เครื่องพิมพ์สามารถใช้งานได้", "First available": "เป็นครั้งแรกที่มีอยู่", "Glass": "กระจก", "Please update your printer's firmware to manage the queue remotely.": "โปรดอัปเดตเฟิร์มแวเครื่องพิมพ์ของคุณในการจัดการคิวระยะไกล", "Configuration Changes": "เปลี่ยนแปลงการกำหนดค่า", "Override": "แทนที่", "The assigned printer, %1, requires the following configuration change:": "เครื่องพิมพ์ที่ได้รับมอบหมาย% 1 ต้องมีการเปลี่ยนแปลงการกำหนดค่าต่อไปนี้:", "The printer %1 is assigned, but the job contains an unknown material configuration.": "เครื่องพิมพ์% 1 ได้รับมอบหมาย แต่งานมีการกำหนดค่าวัสดุที่ไม่รู้จัก", "Change material %1 from %2 to %3.": "เปลี่ยนวัสดุ% 1 จาก% 2 ถึง 3%", "Load %3 as material %1 (This cannot be overridden).": "โหลด% 3% เป็นวัสดุที่ 1 (นี้ไม่สามารถแทนที่)", "Change print core %1 from %2 to %3.": "เปลี่ยนแกนพิมพ์% 1 จาก% 2 ถึง 3%", "Change build plate to %1 (This cannot be overridden).": "เปลี่ยนการสร้างแผ่น% 1 (นี้ไม่สามารถแทนที่)", "Override will use the specified settings with the existing printer configuration. This may result in a failed print.": "แทนที่จะใช้การตั้งค่าที่ระบุไว้กับการกำหนดค่าเครื่องพิมพ์ที่มีอยู่ ซึ่งอาจส่งผลในการพิมพ์ล้มเหลว", "Aluminum": "อลูมิเนียม", "Aborted": "ยกเลิก", "Finished": "เสร็จ", "Aborting...": "ยกเลิก ...", "Pausing...": "หยุด ...", "Resuming...": "กลับมาทำงาน ...", "Action required": "ดำเนินการที่จำเป็น", "Finishes %1 at %2": "เสร็จสิ้น% 1% 2", "Manage printer": "จัดการเครื่องพิมพ์", "The webcam is not available because you are monitoring a cloud printer.": "เว็บแคมไม่สามารถใช้ได้เนื่องจากคุณกำลังตรวจสอบเครื่องพิมพ์เมฆ", "Loading...": "กำลังโหลด ...", "Unavailable": "ไม่มี", "Unreachable": "ไม่สามารถเข้าถึงได้", "Idle": "ว่าง", "Anonymous": "ไม่ระบุชื่อ", "Requires configuration changes": "ต้องมีการเปลี่ยนแปลงการกำหนดค่า", "Details": "รายละเอียด", "Move to top": "ย้ายไปที่ด้านบน", "Delete": "ลบ", "Abort": "การแท้ง", "Are you sure you want to move %1 to the top of the queue?": "คุณแน่ใจหรือว่าต้องการย้าย% 1 ไปด้านบนของคิว?", "Move print job to top": "ย้ายงานพิมพ์ไปด้านบน", "Are you sure you want to delete %1?": "คุณแน่ใจหรือว่าต้องการลบ% 1?", "Delete print job": "งานพิมพ์ลบ", "Are you sure you want to abort %1?": "คุณแน่ใจหรือไม่ว่าคุณต้องการที่จะยกเลิก% 1?", "Print": "พิมพ์", "Printer selection": "เลือกเครื่องพิมพ์", "Queued": "จัดคิว", "Manage in browser": "จัดการในเบราว์เซอร์", "There are no print jobs in the queue. Slice and send a job to add one.": "ไม่มีงานพิมพ์ในคิวอยู่ ฝานและส่งงานให้เพิ่มอีกหนึ่ง", "Print jobs": "งานพิมพ์", "Total print time": "เวลาพิมพ์รวม", "Waiting for": "กำลังรอ", "Open Project": "เปิดโครงการ", "Update existing": "การปรับปรุงที่มีอยู่", "Create new": "สร้างใหม่", "How should the conflict in the machine be resolved?": "ควรมีความขัดแย้งในตัวเครื่องได้รับการแก้ไข?", "How should the conflict in the profile be resolved?": "วิธีควรขัดแย้งในรายละเอียดที่ได้รับการแก้ไข?", "Derivative from": "จากอนุพันธ์", "%1, %2 override": "% 1% 2 แทนที่", "Material settings": "การตั้งค่าวัสดุ", "How should the conflict in the material be resolved?": "วิธีควรขัดแย้งในวัสดุที่ได้รับการแก้ไข?", "Setting visibility": "การตั้งค่าการแสดงผล", "Mode": "โหมด", "Visible settings:": "การตั้งค่าที่แสดง:", "%1 out of %2": "1% จาก 2%", "Loading a project will clear all models on the build plate.": "โหลดโครงการจะล้างทุกรูปแบบในการสร้างแผ่น", "Open": "เปิด", "Mesh Type": "ประเภทตาข่าย", "Normal model": "รูปแบบปกติ", "Print as support": "พิมพ์การสนับสนุน", "Modify settings for overlaps": "การตั้งค่าสำหรับการปรับเปลี่ยนการทับซ้อน", "Don't support overlaps": "ไม่สนับสนุนการทับซ้อน", "Infill only": "infill เท่านั้น", "Select settings": "เลือกการตั้งค่า", "Select Settings to Customize for this model": "เลือกการตั้งค่าเพื่อปรับแต่งสำหรับรุ่นนี้", "Show all": "แสดงทั้งหมด", "Post Processing Plugin": "โพสต์ปลั๊กอินการประมวลผล", "Post Processing Scripts": "สคริปโพสต์การประมวลผล", "Add a script": "เพิ่มสคริปต์", "Change active post-processing scripts": "เปลี่ยนการใช้งานสคริปต์การโพสต์", "Firmware is the piece of software running directly on your 3D printer. This firmware controls the step motors, regulates the temperature and ultimately makes your printer work.": "เฟิร์มแวเป็นชิ้นส่วนของซอฟต์แวร์ที่ทำงานโดยตรงบนเครื่องพิมพ์ 3D ของคุณ เฟิร์มแวนี้ควบคุมมอเตอร์ขั้นตอนการควบคุมอุณหภูมิและในที่สุดทำให้การทำงานของเครื่องพิมพ์ของคุณ", "The firmware shipping with new printers works, but new versions tend to have more features and improvements.": "เฟิร์มการจัดส่งสินค้าที่มีผลงานเครื่องพิมพ์ใหม่ แต่รุ่นใหม่มีแนวโน้มที่จะมีคุณสมบัติที่มากขึ้นและการปรับปรุง", "Automatically upgrade Firmware": "อัพเกรดเฟิร์มแวอัตโนมัติ", "Upload custom Firmware": "อัปโหลดเฟิร์มแวกำหนดเอง", "Firmware can not be updated because there is no connection with the printer.": "เฟิร์มแวไม่สามารถอัปเดตเพราะมีการเชื่อมต่อกับเครื่องพิมพ์ไม่มี", "Firmware can not be updated because the connection with the printer does not support upgrading firmware.": "เฟิร์มแวไม่สามารถอัปเดตเพราะการเชื่อมต่อกับเครื่องพิมพ์ไม่สนับสนุนการอัพเกรดเฟิร์มแว", "Select custom firmware": "เลือก firmware เอง", "Firmware Update": "อัปเดตเฟิร์มแว", "Updating firmware.": "เฟิร์มแวปรับปรุง", "Firmware update completed.": "อัปเดตเฟิร์มแวเสร็จสมบูรณ์", "Firmware update failed due to an unknown error.": "อัปเดตเฟิร์มแวล้มเหลวเนื่องจากข้อผิดพลาดที่ไม่รู้จัก", "Firmware update failed due to an communication error.": "อัปเดตเฟิร์มแวล้มเหลวเนื่องจากข้อผิดพลาดในการสื่อสาร", "Firmware update failed due to an input/output error.": "อัปเดตเฟิร์มแวล้มเหลวเนื่องจากข้อผิดพลาดอินพุต / เอาต์พุต", "Firmware update failed due to missing firmware.": "อัปเดตเฟิร์มแวล้มเหลวเนื่องจากเฟิร์มที่ขาดหายไป", "Please make sure your printer has a connection:\n- Check if the printer is turned on.\n- Check if the printer is connected to the network.\n- Check if you are signed in to discover cloud-connected printers.": "กรุณาตรวจสอบให้แน่ใจว่าเครื่องพิมพ์ของคุณมีการเชื่อมต่อ:\n- ตรวจสอบว่าเครื่องพิมพ์เปิดอยู่\n- ตรวจสอบว่าเครื่องพิมพ์ที่เชื่อมต่อกับเครือข่าย\n- ตรวจสอบว่าคุณลงชื่อเข้าใช้ในการค้นพบเครื่องพิมพ์ระบบคลาวด์ที่เชื่อมต่อ", "Please connect your printer to the network.": "โปรดเชื่อมต่อเครื่องพิมพ์เข้ากับเครือข่าย", "View user manuals online": "คู่มือผู้ใช้ดูออนไลน์", "Want more?": "ต้องการมากขึ้น?", "Backup Now": "การสำรองข้อมูลในขณะนี้", "Auto Backup": "การสำรองข้อมูลอัตโนมัติ", "Automatically create a backup each day that Cura is started.": "โดยอัตโนมัติสร้างการสำรองข้อมูลในแต่ละวันที่จะเริ่มต้น Cura", "Cura Version": "การดูแลรุ่น", "Machines": "เครื่อง", "Restore": "ฟื้นฟู", "Delete Backup": "การสำรองข้อมูลลบ", "Are you sure you want to delete this backup? This cannot be undone.": "คุณแน่ใจหรือไม่ว่าต้องการลบการสำรองข้อมูลนี้? นี้ไม่สามารถยกเลิกได้", "Restore Backup": "คืนค่าการสำรองข้อมูล", "You will need to restart Cura before your backup is restored. Do you want to close Cura now?": "คุณจะต้องเริ่มต้นใหม่ Cura ก่อนสำรองของคุณจะถูกเรียกคืน คุณต้องการที่จะปิด Cura ตอนนี้หรือไม่", "Cura Backups": "การสำรองข้อมูล Cura", "My Backups": "การสำรองข้อมูลของฉัน", "You don't have any backups currently. Use the 'Backup Now' button to create one.": "คุณไม่จำเป็นต้องสำรองข้อมูลใด ๆ ในขณะนี้ ใช้ปุ่ม 'Backup Now' เพื่อสร้างหนึ่ง", "During the preview phase, you'll be limited to 5 visible backups. Remove a backup to see older ones.": "ในระหว่างขั้นตอนการแสดงตัวอย่างของคุณจะถูก จำกัด ให้ 5 การสำรองข้อมูลที่มองเห็นได้ นำการสำรองข้อมูลเพื่อดูว่าคนที่มีอายุมากกว่า", "Backup and synchronize your Cura settings.": "การสำรองข้อมูลและประสานการตั้งค่า Cura ของคุณ", "Color scheme": "โทนสี", "Material Color": "วัสดุสี", "Line Type": "ประเภทสาย", "Feedrate": "Feedrate", "Layer thickness": "ความหนาของชั้น", "Compatibility Mode": "โหมดที่เข้ากัน", "Travels": "การเดินทาง", "Helpers": "ผู้ช่วย", "Shell": "เปลือก", "Only Show Top Layers": "เฉพาะเลเยอร์แสดงยอดนิยม", "Show 5 Detailed Layers On Top": "แสดง 5 ชั้นรายละเอียดด้านบน", "Top / Bottom": "ด้านบน / ล่าง", "Inner Wall": "ภายในกำแพง", "min": "ผม", "max": "สูงสุด", "Some things could be problematic in this print. Click to see tips for adjustment.": "บางสิ่งบางอย่างที่อาจจะมีปัญหาในการพิมพ์นี้ คลิกเพื่อดูเคล็ดลับสำหรับการปรับ", "Provides support for importing Cura profiles.": "ให้การสนับสนุนสำหรับการนำเข้าโปรไฟล์ Cura", "Cura Profile Reader": "Cura ข้อมูลส่วนตัวของผู้อ่าน", "Submits anonymous slice info. Can be disabled through preferences.": "ส่งข้อมูลชิ้นที่ไม่ระบุชื่อ สามารถใช้งานผ่านการตั้งค่า", "Slice info": "ข้อมูลชิ้น", "Enables ability to generate printable geometry from 2D image files.": "ช่วยให้ความสามารถในการสร้างรูปทรงเรขาคณิตที่พิมพ์จากไฟล์ภาพ 2D", "Image Reader": "อ่านภาพ", "Provides a way to change machine settings (such as build volume, nozzle size, etc.).": "มีวิธีการตั้งค่าเครื่องการเปลี่ยนแปลง (เช่นการสร้างปริมาณขนาดหัวฉีด ฯลฯ )", "Machine Settings action": "การดำเนินการตั้งค่าเครื่อง", "Provides removable drive hotplugging and writing support.": "ให้ hotplugging ไดรฟ์แบบถอดได้และการเขียนการสนับสนุน", "Removable Drive Output Device Plugin": "ปลั๊กอินที่ถอดออกได้อุปกรณ์ไดรฟ์เอาท์พุท", "Find, manage and install new Cura packages.": "ค้นหาจัดการและติดตั้งแพคเกจ Cura ใหม่", "Toolbox": "กล่องเครื่องมือ", "Provides support for reading AMF files.": "ให้การสนับสนุนสำหรับการอ่านไฟล์สารเลว", "AMF Reader": "AMF อ่าน", "Provides a normal solid mesh view.": "ให้มุมมองที่เป็นของแข็งตาข่ายปกติ", "Solid View": "ดูแข็ง", "Provides machine actions for Ultimaker machines (such as bed leveling wizard, selecting upgrades, etc.).": "ให้การกระทำของเครื่องสำหรับเครื่อง Ultimaker (เช่นตัวช่วยสร้างเตียงปรับระดับการอัพเกรดเลือกอื่น ๆ )", "Ultimaker machine actions": "การกระทำของเครื่อง Ultimaker", "Accepts G-Code and sends them to a printer. Plugin can also update firmware.": "ยอมรับ G-Code และส่งพวกเขาไปยังเครื่องพิมพ์ ปลั๊กอินยังสามารถอัปเดตเฟิร์มแว", "Manages network connections to Ultimaker networked printers.": "การบริหารจัดการการเชื่อมต่อเครือข่ายไปยังเครื่องพิมพ์ Ultimaker เครือข่าย", "Ultimaker Network Connection": "การเชื่อมต่อเครือข่าย Ultimaker", "Provides support for reading 3MF files.": "ให้การสนับสนุนสำหรับการอ่านไฟล์ 3MF", "3MF Reader": "3MF อ่าน", "Creates an eraser mesh to block the printing of support in certain places": "สร้างยางลบตาข่ายเพื่อป้องกันการพิมพ์ของการสนับสนุนในสถานที่บางอย่าง", "Support Eraser": "สนับสนุนยางลบ", "Provides the Per Model Settings.": "ให้การตั้งค่าต่อรุ่น", "Per Model Settings Tool": "ต่อรุ่นเครื่องมือการตั้งค่า", "Provides a preview stage in Cura.": "ให้เป็นเวทีการแสดงตัวอย่างใน Cura", "Preview Stage": "ดูตัวอย่างเวที", "Provides the X-Ray view.": "ให้มุมมอง X-Ray", "X-Ray View": "X-Ray ดู", "Upgrades configurations from Cura 3.5 to Cura 4.0.": "การกำหนดค่าการอัพเกรดจาก Cura 3.5 ถึง 4.0 Cura", "Version Upgrade 3.5 to 4.0": "เวอร์ชันอัพเกรด 3.5-4.0", "Upgrades configurations from Cura 2.6 to Cura 2.7.": "การกำหนดค่าการอัพเกรดจาก Cura 2.6 Cura 2.7", "Version Upgrade 2.6 to 2.7": "เวอร์ชันอัพเกรด 2.6-2.7", "Upgrades configurations from Cura 2.1 to Cura 2.2.": "การกำหนดค่าการอัพเกรดจาก Cura 2.1 Cura 2.2", "Version Upgrade 2.1 to 2.2": "เวอร์ชันอัพเกรด 2.1-2.2", "Upgrades configurations from Cura 3.4 to Cura 3.5.": "การกำหนดค่าการอัพเกรดจาก Cura 3.4 Cura 3.5", "Version Upgrade 3.4 to 3.5": "เวอร์ชันอัพเกรด 3.4-3.5", "Upgrades configurations from Cura 4.4 to Cura 4.5.": "การกำหนดค่าการอัพเกรดจาก Cura 4.4 Cura 4.5", "Version Upgrade 4.4 to 4.5": "เวอร์ชันอัพเกรด 4.4-4.5", "Upgrades configurations from Cura 3.3 to Cura 3.4.": "การกำหนดค่าการอัพเกรดจาก Cura 3.3 ถึง 3.4 Cura", "Version Upgrade 3.3 to 3.4": "เวอร์ชันอัพเกรด 3.3-3.4", "Upgrades configurations from Cura 3.0 to Cura 3.1.": "การกำหนดค่าการอัพเกรดจาก Cura 3.0 Cura 3.1", "Version Upgrade 3.0 to 3.1": "เวอร์ชันอัพเกรด 3.0-3.1", "Upgrades configurations from Cura 3.2 to Cura 3.3.": "การกำหนดค่าการอัพเกรดจาก Cura 3.2 Cura 3.3", "Version Upgrade 3.2 to 3.3": "เวอร์ชันอัพเกรด 3.2-3.3", "Upgrades configurations from Cura 2.2 to Cura 2.4.": "การกำหนดค่าการอัพเกรดจาก Cura 2.2 Cura 2.4", "Version Upgrade 2.2 to 2.4": "เวอร์ชันอัพเกรด 2.2-2.4", "Upgrades configurations from Cura 2.5 to Cura 2.6.": "การกำหนดค่าการอัพเกรดจาก Cura 2.5 ถึง 2.6 Cura", "Version Upgrade 2.5 to 2.6": "เวอร์ชันอัพเกรด 2.5-2.6", "Upgrades configurations from Cura 4.3 to Cura 4.4.": "การกำหนดค่าการอัพเกรดจาก Cura 4.3 Cura 4.4", "Version Upgrade 4.3 to 4.4": "เวอร์ชันอัพเกรด 4.3-4.4", "Upgrades configurations from Cura 2.7 to Cura 3.0.": "การกำหนดค่าการอัพเกรดจาก Cura 2.7 Cura 3.0", "Version Upgrade 2.7 to 3.0": "เวอร์ชันอัพเกรด 2.7-3.0", "Upgrades configurations from Cura 4.0 to Cura 4.1.": "การกำหนดค่าการอัพเกรดจาก Cura 4.0 Cura 4.1", "Version Upgrade 4.0 to 4.1": "เวอร์ชันอัพเกรด 4.0-4.1", "Upgrades configurations from Cura 4.2 to Cura 4.3.": "การกำหนดค่าการอัพเกรดจาก Cura 4.2 Cura 4.3", "Version Upgrade 4.2 to 4.3": "เวอร์ชันอัพเกรด 4.2-4.3", "Upgrades configurations from Cura 4.1 to Cura 4.2.": "การกำหนดค่าการอัพเกรดจาก Cura 4.1 ถึง 4.2 Cura", "Version Upgrade 4.1 to 4.2": "เวอร์ชันอัพเกรด 4.1-4.2", "Allows loading and displaying G-code files.": "ช่วยให้การโหลดและการแสดงไฟล์ G-รหัส", "G-code Reader": "G-Code Reader", "Extension that allows for user created scripts for post processing": "ส่วนต่อขยายที่ช่วยให้การสร้างผู้ใช้สคริปต์สำหรับการประมวลผลการโพสต์", "Provides the link to the CuraEngine slicing backend.": "ให้เชื่อมโยงไปยังแบ็กเอนด์ CuraEngine หั่น", "CuraEngine Backend": "CuraEngine Backend", "Provides support for importing profiles from legacy Cura versions.": "ให้การสนับสนุนสำหรับการนำเข้าจากโปรไฟล์มรดกรุ่น Cura", "Legacy Cura Profile Reader": "มรดก Cura โปรไฟล์อ่าน", "Provides support for reading Ultimaker Format Packages.": "ให้การสนับสนุนสำหรับการอ่าน Ultimaker แพคเกจรูปแบบ", "UFP Reader": "UFP อ่าน", "Provides support for importing profiles from g-code files.": "ให้การสนับสนุนสำหรับการนำเข้าโปรไฟล์จากไฟล์กรัมรหัส", "G-code Profile Reader": "G-Code Reader เครื่องอ่านข้อมูลส่วนตัว", "Provides support for exporting Cura profiles.": "ให้การสนับสนุนสำหรับการส่งออกโปรไฟล์ Cura", "Cura Profile Writer": "Cura ข้อมูลส่วนตัวของนักเขียน", "Provides a machine actions for updating firmware.": "ให้การกระทำของเครื่องสำหรับการปรับปรุงเฟิร์มแว", "Firmware Updater": "อัพเดตเฟิร์มแว", "Provides a prepare stage in Cura.": "ให้เตรียมความพร้อมในเวที Cura", "Prepare Stage": "เตรียมเวที", "Provides support for reading model files.": "ให้การสนับสนุนสำหรับการอ่านไฟล์รูปแบบ", "Trimesh Reader": "Trimesh อ่าน", "Provides support for writing 3MF files.": "ให้การสนับสนุนสำหรับการเขียนไฟล์ 3MF", "3MF Writer": "3MF นักเขียน", "Writes g-code to a file.": "เขียนกรัมรหัสไปยังแฟ้ม", "G-code Writer": "G-รหัสนักเขียน", "Provides a monitor stage in Cura.": "มีขั้นตอนการตรวจสอบใน Cura", "Monitor Stage": "การตรวจสอบขั้นตอน", "Provides capabilities to read and write XML-based material profiles.": "มีความสามารถในการอ่านและการเขียน XML-based โปรไฟล์วัสดุ", "Material Profiles": "วัสดุโปรไฟล์", "Backup and restore your configuration.": "สำรองและเรียกคืนการตั้งค่าของคุณ", "Provides support for reading X3D files.": "ให้การสนับสนุนสำหรับการอ่านไฟล์ X3D", "X3D Reader": "X3D อ่าน", "Provides the Simulation view.": "ให้มุมมองการจำลอง", "Reads g-code from a compressed archive.": "อ่านกรัมรหัสจากที่เก็บบีบอัด", "Compressed G-code Reader": "การบีบอัด G-Code Reader", "Provides support for writing Ultimaker Format Packages.": "ให้การสนับสนุนสำหรับการเขียน Ultimaker แพคเกจรูปแบบ", "UFP Writer": "UFP นักเขียน", "Checks models and print configuration for possible printing issues and give suggestions.": "แบบจำลองการตรวจสอบและการกำหนดค่าการพิมพ์สำหรับปัญหาการพิมพ์ที่เป็นไปได้และให้ข้อเสนอแนะ", "Model Checker": "ตรวจสอบรุ่น", "Logs certain events so that they can be used by the crash reporter": "แฟ้มบันทึกเหตุการณ์บางอย่างเพื่อให้พวกเขาสามารถนำมาใช้โดยนักข่าวผิดพลาด", "Sentry Logger": "ยาม Logger", "Writes g-code to a compressed archive.": "เขียนกรัมรหัสที่เก็บบีบอัด", "Compressed G-code Writer": "การบีบอัด G-รหัสนักเขียน", "Checks for firmware updates.": "ตรวจสอบการอัปเดตเฟิร์มแว", "Firmware Update Checker": "Firmware Update ตรวจสอบ"}