{" ": " ", "Machine": "เครื่อง", "Machine specific settings": "การตั้งค่าเครื่องที่เฉพาะเจาะจง", "Extruder": "extruder", "The extruder train used for printing. This is used in multi-extrusion.": "รถไฟอัดรีดใช้สำหรับการพิมพ์ นี้จะใช้ในหลายอัดขึ้นรูป", "Nozzle ID": "ID หัวฉีด", "The nozzle ID for an extruder train, such as \"AA 0.4\" and \"BB 0.8\".": "รหัสหัวฉีดสำหรับเครื่องอัดรีดรถไฟเช่น \"AA 0.4\" และ \"บีบี 0.8\"", "Nozzle Diameter": "เส้นผ่านศูนย์กลางหัวฉีด", "The inner diameter of the nozzle. Change this setting when using a non-standard nozzle size.": "เส้นผ่าศูนย์กลางด้านในของหัวฉีด เปลี่ยนการตั้งค่านี้เมื่อใช้ขนาดหัวฉีดที่ไม่ได้มาตรฐาน", "Nozzle X Offset": "หัวฉีด X Offset", "The x-coordinate of the offset of the nozzle.": "พิกัด x ของ offset ของหัวฉีด", "Nozzle Y Offset": "หัวฉีด Y Offset", "The y-coordinate of the offset of the nozzle.": "พิกัด y ของ offset ของหัวฉีด", "Extruder Start G-Code": "Extruder เริ่มต้น G-Code", "Start g-code to execute when switching to this extruder.": "เริ่มต้นกรัมรหัสในการดำเนินการเมื่อเปลี่ยนเครื่องอัดรีดนี้", "Extruder Start Position Absolute": "Extruder ตำแหน่งเริ่มต้นแอบโซลูท", "Make the extruder starting position absolute rather than relative to the last-known location of the head.": "ทำให้เครื่องอัดรีดตำแหน่งเริ่มต้นที่แน่นอนมากกว่าเมื่อเทียบกับตำแหน่งสุดท้ายที่รู้จักกันของหัว", "Extruder Start Position X": "Extruder ตำแหน่งเริ่มต้น X", "The x-coordinate of the starting position when turning the extruder on.": "พิกัด x ของตำแหน่งเริ่มต้นเมื่อเปิดเครื่องอัดรีดบน", "Extruder Start Position Y": "Extruder ตำแหน่งเริ่มต้น Y", "The y-coordinate of the starting position when turning the extruder on.": "พิกัด y ของตำแหน่งเริ่มต้นเมื่อเปิดเครื่องอัดรีดบน", "Extruder End G-Code": "Extruder End G-Code", "End g-code to execute when switching away from this extruder.": "End กรัมรหัสที่จะดำเนินการเมื่อมีการสลับออกไปจากเครื่องอัดรีดนี้", "Extruder End Position Absolute": "Extruder ตำแหน่ง End แอบโซลูท", "Make the extruder ending position absolute rather than relative to the last-known location of the head.": "ทำให้เครื่องอัดรีดสิ้นสุดตำแหน่งที่แน่นอนมากกว่าเมื่อเทียบกับตำแหน่งสุดท้ายที่รู้จักกันของหัว", "Extruder End Position X": "Extruder End ตำแหน่ง X", "The x-coordinate of the ending position when turning the extruder off.": "พิกัด x ตำแหน่งสิ้นสุดเมื่อปิดเครื่องอัดรีด", "Extruder End Position Y": "Extruder End ตำแหน่ง Y", "The y-coordinate of the ending position when turning the extruder off.": "พิกัด y ของตำแหน่งสิ้นสุดเมื่อปิดเครื่องอัดรีด", "Extruder Prime Z Position": "Extruder นายกรัฐมนตรี Z ตำแหน่ง", "The Z coordinate of the position where the nozzle primes at the start of printing.": "ซีพิกัดของตำแหน่งที่หัวฉีดเฉพาะในช่วงเริ่มต้นของการพิมพ์", "Extruder Print Cooling Fan": "Extruder พิมพ์พัดลมระบายความร้อน", "The number of the print cooling fan associated with this extruder. Only change this from the default value of 0 when you have a different print cooling fan for each extruder.": "จำนวนพิมพ์พัดลมระบายความร้อนที่เกี่ยวข้องกับเครื่องอัดรีดนี้ เพียง แต่เปลี่ยนจากค่าเริ่มต้นของ 0 เมื่อคุณมีการพิมพ์พัดลมระบายความร้อนที่แตกต่างกันสำหรับแต่ละเครื่องอัดรีด", "Build Plate Adhesion": "การยึดเกาะรูปร่างจาน", "Adhesion": "ความศรัทธา", "Extruder Prime X Position": "Extruder นายกรัฐมนตรี X ตำแหน่ง", "The X coordinate of the position where the nozzle primes at the start of printing.": "เอ็กซ์พิกัดของตำแหน่งที่หัวฉีดเฉพาะในช่วงเริ่มต้นของการพิมพ์", "Extruder Prime Y Position": "Extruder นายกรัฐมนตรีตำแหน่ง Y", "The Y coordinate of the position where the nozzle primes at the start of printing.": "พิกัด y ของตำแหน่งที่หัวฉีดเฉพาะในช่วงเริ่มต้นของการพิมพ์", "Material": "วัสดุ", "Diameter": "เส้นผ่าศูนย์กลาง", "Adjusts the diameter of the filament used. Match this value with the diameter of the used filament.": "ปรับขนาดเส้นผ่าศูนย์กลางของเส้นใยที่ใช้ ตรงกับค่านี้มีขนาดเส้นผ่าศูนย์กลางของเส้นใยที่ใช้"}